[{"_id":{ "$oid": "59ea3eb1e548b80e6a521c5b" },"Professor":"Michael Woodbury","Course_ID":"MATH V1201","Course_Name":"Calculus III","Review":"As far as the Columbia math department goes, Woodbury is a gem. He's young, passionate, interesting, and speaks fluent English. His lectures are interesting, easy to follow, and appropriately paced. He's available for extra help, his tests are reasonably hard without being impossible, and the homework assignments and practice tests are very helpful in terms of test prep. He made the effort to learn literally every student's name (in a class of over 100 students) and sometimes tells funny little stories in the middle of lecture (not too distracting, but often a very nice break). The homeworks are intense (WebAssign as well as a regular written problem set) but are definitely doable. He scales well and drops the lowest few homework grades. I didn't have a strong math background going into the class but was able to follow it with little difficulty and definitely learned a lot. \n\n          Workload:\n        several HW assignments (WebAssign and written), two midterms (doable), final (harder than the midterms but not the worst).","Date":"April 30, 2013"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c5c" },"Professor":"Michael Woodbury","Course_ID":"MATH V1201","Course_Name":"Calculus III","Review":"Columbia has a lot of intelligent professors, but very few of them are good teachers. Woodbury looks hardly older than a TA, but lectures like he's been teaching for ages. He is a naturally gifted teacher who takes the effort to make sure that every student understands the material. He is approachable and welcomes student participation. There are times when he makes mistakes on the board - please correct him, he'll appreciate it. He may seem to be moving along a little slowly sometimes, but he ensures that he explains every concept in detail so that you understand. This is a good thing. With all the homework and his great teaching, you really don't have to study much for exams. You can tell that he's very passionate about math because he points out neat stuff and shortcuts all the time. Woodbury doesn't like formulas, preferring to derive them on the spot from concepts - this helps boost student comprehension. He is also a very nice person to boot - by the first month of class, he knew almost everyone's name (there were about a 100 of us).\n\nThe first half of the semester was kind of boring as Woodbury did really basic stuff like vectors, complex numbers, conics and planes. The second half was much more engaging - he covered 3D geometry, quadric surfaces, partial differentiation, etc.\n\nThe first midterm was painfully easy. The second midterm was hell because it involved a lot of tedious calculations like differentiating a complicated 3 variable function three times and finding it's magnitude to get the normal vector. The final was between the two. Woodbury is a fair grader - not easy, not hard.\n\nHomework was heavier than other sections because Woodbury uses WebAssign but not bad. Note that you must purchase the textbook for $110 to get WebAssign. The PDF of Stewart Calculus you got from a friend won't help you here.\n\nWoodbury is probably one of the best Calc III professors. I highly recommend taking his class.\n\n          Workload:\n        12 Assignments (each consists of a Written HW of 8-15 problems and a WebAssign assignment of 10-20 problems)\n2 Midterms (1 easy, 1 hard)\n1 Final (easy-medium difficulty)","Date":"December 24, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c5d" },"Professor":"Michael Woodbury","Course_ID":"MATH V1201","Course_Name":"Calculus III","Review":"His lectures are clear but if I got lost I had a hard time catching back up. He makes himself very available and is committed to helping students understand the material. I found the quizzes (every other week or so) difficult even when I understood the material but he's pretty generous about dropping the lowest quizzes and homeworks. Tests are written clearly and fairly, and he's reasonable about adjusting credit on everything if the TAs grade weirdly. He learned the name of everyone in the class quickly, and is a really nice guy.\n\n          Workload:\n        Not too bad - 1 reasonable problem set a week, occasional WebAssign, quizzes, 1 not-bad group project.","Date":"April 11, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c5e" },"Professor":"Michael Woodbury","Course_ID":"MATH V1202","Course_Name":"Calculus IV","Review":"If you're looking for a pretty solid professor in the math department whose native tongue is English and can explain things reasonably well, Professor Woodbury is your guy. This was his first semester at Columbia, and he's a young guy who just finished his PhD at Wisconsin, so I'd imagine he's a little inexperienced and can only get better as a professor.\n\nYou can tell that he really cares and is trying really hard, but sometimes you don't want to hear about line integrals in the complex plane for an hour and fifteen on a Monday morning. This is only problematic because, unlike a lot of other math classes, class is often unskippable: he never mentioned whether we could turn in our weekly problem sets in the box, like most other math classes, and there are six quizzes throughout the semester, which were all pretty easy, but their existence means you have to go to class at least some of the time.\n\nOn the bright side, he knows everyone's name and is really, really nice and generous with his office hours. And if you're ever up for talking about frisbees and Sufjan Stevens, go to his office hours or just show up to class early.\n\nI mostly wrote this review because I want people to feel comfortable that they're not doomed to a hellish semester if they choose to take Professor Woodbury's class.\n\n          Workload:\n        Not too bad at all; weekly problem sets took 2-4 hours apiece, and the exams were all pretty straightforward.\n\nTen of twelve problem sets counted, but if you chose to get the online thing, you had four more opportunities, so there were pretty much sixteen opportunities to get your ten best scores. Two midterms and a final, but on the final, you get a cheat sheet with whatever information on that you could possibly want.\n\nHomework: 20%, Midterms: 20% each, Final: 40%","Date":"January 09, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c5f" },"Professor":"Michael Woodbury","Course_ID":"MATH V1201","Course_Name":"Calculus III","Review":"He's a nice guy and really cares about his students; he even learned everyones name within a few weeks (yes, all 100 of us). Nonetheless, he isn't that great of a lecturer. He often provides explanations that are confusing at best. In particular, I remember that he spent one entire lecture going over HW problems instead of new material… \n\nHe also requires webassign (1 webassign and 1 written hw every week). \n\nI find that a lot of his hw problems are very tedious in terms of the amount of pure algebra required (especially when you get to CH 13). However, he drops the lowest 4 hw grades.\n\nHe posts a practice midterm before each midterm but refuses to provide solutions--he only posts answers. However, he does post solutions to hw sets before each midterm. He also provides a detailed review before each midterm which is VERY helpful. I often find that his typed notes that he ocassionaly posts are much more helpful than his lectures.\n\nExams/HW tends to be returned fairly quickly--1 or 2 class after it is handed in.\n\n\n\n          Workload:\n        not bad if you're good at math. weekly written hw/webassign, 2 midterms, 1 final","Date":"December 22, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c60" },"Professor":"Michael Woodbury","Course_ID":"MATH V1201","Course_Name":"Calculus III","Review":"Professor Woodbury is probably one of the best math professors I've had. I shopped several Calc 3 classes before finally deciding to take his class. Although I had to withdraw from his class for personal reasons, I'm very glad I took it for the time I was in it. He's a Native English speaker (always a plus at Columbia), so no worrying about heavy accents here. The notes he puts on the board are very clear and very well organized. Something that I noticed that other professors don't do is that he never uses a method of notation without explaining it to the class, which is very good for students who got AP calculus credit in high school but didn't necessarily learn set notation. He is very good at making himself available to students--he asks for input on when he should have office hours or outside of class review sessions (which he does sometimes!) and he made an effort to know everyone's names. He is also very passionate about math, which makes the class that much more interesting. He gets very excited about the concepts he's teaching and, if someone is juvenile enough to ask what's the purpose of learning this level of math, he will genuinely respond with, \"because it's beautiful.\"\n\n          Workload:\n        Two problem sets a week--one written and one WebAssign. Depending on the week, they can take anywhere from thirty minutes to seven hours each. Two difficult but fair midterms and a final.","Date":"November 20, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c61" },"Professor":"Michael Woodbury","Course_ID":"MATH V1202","Course_Name":"Calculus IV","Review":"Great class. This was the first time that I attended almost every class of a calculus course at Columbia. Woodbury's explanations are extremely clear and he puts huge emphasis on making students understand rather than memorize the material. He starts on new concepts by drawing parallels from Calculus I, II and III and explaining how the new idea is just an extension of an old idea in many dimensions, vector form, etc. The homeworks and exams require you to understand the material but also to be able to apply it to solve different kinds of problems.Woodbury is also very friendly, makes it a point to get to know every student's name and is willing to provide help when needed. The calculus sequence is normally thought of as a dull requirement that simply has to be done, but I actually really enjoyed this class. Definitely take it with Woodbury if you can.\n\n          Workload:\n        See other reviews","Date":"January 05, 2014"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c62" },"Professor":"Emmanuel Zur","Course_ID":"BUSI W3013","Course_Name":"Financial Accounting","Review":"I'm not sure if Manuel is an incredibly gifted instructor, or if Financial Accounting is the sort of class that could really be taught in a single month and happens to be stretched into an entire semester-long course. (Probably a bit of both.)\n\nHe presents the material very clearly, sometimes to the point of making things almost painfully slow. That said, while Financial Accounting is the sort of class that can be incredibly dry, he does a good job of making it engaging, despite the slow pace. At times, he would print out news articles or mention current companies in the news, just to make the material a bit less dry and abstract.\n\nSince a number of people are taking this class as a requirement, you get enough people to round out the bottom of the grading curve. If you're reasonably prepared for this class (remember your basic math - middle school level multiplication and percents), you should find this class to be very light.\n\nDo yourself a favor and go to class, and you won't have to do much studying for the exams. \n\nAlso, ask him about his days as a spy in the Israeli army. He's up-front about this (mentioned it on the first day of class). He has some good stories to tell.\n\nIn short, Financial Accounting will never be the most exciting class you take, but if you really want to learn the material (or need to take it for a requirement), I can't imagine a better choice of professor.\n\n          Workload:\n        6 problem sets, very easy grading. In-class midterm and take-home final, both very straightforward. If you can do the practice problems, you have no reason not to ace both exams (and the course).","Date":"April 09, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c63" },"Professor":"Ana Paula Huback","Course_ID":"PORT W1220","Course_Name":"Comprehensive Intermediate Portuguese","Review":"Ana Paula is the best professor I've had at Columbia.  She is super organized and lets you know the class schedule/assignments even up to 3 weeks in advance.  She is also very intelligent and an excellent language teacher; by the end of the semester my Portuguese level had improved from basic to almost fluency.  This class is however not an \"easy A\", it's not particularly hard but in order to get an A or A+ you need to put in quite a bit of effort.  Ana Paula is a fair and very transparent grader and will give you the grade you deserve.  That being said, the assignments are fun and varied and there is a lot of leeway to work on what interests you so putting in the effort shouldn't be difficult.  All in all it was a great class and arguably the best I've taken at Columbia.\n\n          Workload:\n        3 or so presentations, 5/6 one page essays, weekly one-paragraph commentary on a video, regular homework, one midterm and one final","Date":"January 03, 2013"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c64" },"Professor":"Ana Paula Huback","Course_ID":"PORT W1220","Course_Name":"Comprehensive Intermediate Portuguese","Review":"Ana Paula is the best language teacher I've ever had & one of the nicest professors at Columbia.  She is understanding & helpful and crafts a comprehensive curriculum that might be overwhelming if she didn't structure it so well.  She does a great job of creating an easy-going classroom environment.  \n\nDespite the fact that I had this class 3 times a week, and it could easily have felt tenuous to attend so often, I enjoyed it immensely!\n\n          Workload:\n        weekly assignments (written or oral presentations) + nightly mini-assignments that take almost no time\n1 midterm + 1 final","Date":"September 12, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c65" },"Professor":"Stephen Scott","Course_ID":"ANTH V1002","Course_Name":"The Interpretation Of Culture","Review":"Great class and great professor! Professor Scott's class was a great introduction to anthropology. He almost made me switch my minor from psychology to anthropology because he was such a great lecturer.\n\nAlthough his class wasn't the easiest to take notes in just because sometimes he would diverge from a topic. It was great because he always used real life examples which made the material so much clearer. \n\nI also went to his office hours and had a whole hour conversation with him about life. He shared a lot of insight and really made me understand the world better. \n\nPlus he is witty and hilarious. I would say he is one of my favorite professors so far in college. \n\n          Workload:\n        3 or 4 short essays. The topics are all really interesting. \none midterm\none final- the review session was really really helpful","Date":"February 01, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c66" },"Professor":"Van Molino","Course_ID":"APMA 4300","Course_Name":"Numerical Methods","Review":"I have taken two courses with Van Molino. One of them was Functions of a Complex Variable, the other one Intro to Numerical Methods. And they were not only the most difficult math classes I've taken anywhere (quite a bit more difficult than PDE & Real Analysis), they were also the most frustrating, due to his inexplicable teaching style. \n\nHe never posts lecture slides, the reason for which is that he believes if he posts them people will stop coming to class. But anyone who's been to class knows that these lecture slides are just outlines and are by no means reasonable substitutes for the materials one has to absorb in class. In other math classes the professors would often post the lecture notes beforehand, so I wouldn't need to worry about having to copy them down frantically in class while trying to learn the materials, which is what I did in his lectures (lots and lots of notes). Besides, I believe if some students don't want to come to lectures it's entirely their loss, having paid for their education and all. Why Van Molino would accommodate them to the detriment of the whole class is beyond me.\n\nAnd like the other reviewer has pointed out, most of the problems he goes over in class are quite easy. They're nothing like the problems we have to solve in our assignments and exams. When he claims the hw will take 3-4 hrs a good rule of thumb is to double that time, and I've found myself in a few instances spending more than 9 hrs on a problem set, before either giving up or heading to office hour, which is right before the class starts and hence right before hw is due. \n\nExams are, simply put, nightmares. He doesn't give practice exams because, in his words, whatever problems he puts in practice exams will not appear in the real exams, so practice exams will not look anything like the real exams and thus serve no purpose. I can't help but feel this sophistry is really an excuse for him not to write practice exams. The real exams are horrendous. People walked out dumbfounded. I actually saw a girl cry. And many people did horribly not because they didn't take time to digest the materials, but simply because there was no way, given the way the class was designed, they could be properly prepared. Midterms and finals should be examinations of how thoroughly the students have mastered the materials, not emotional beat-downs.\n\nThe only good side is Van Molino is a decent lecturer and explains things fairly well. But that doesn't tip my verdict in his favor--avoid him at all costs.\n\n          Workload:\n        Weekly assignments which he claimed took 3-4 hrs to complete, but took at least double the time. As for exams, good luck--you'll need it.","Date":"January 07, 2014"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c67" },"Professor":"Van Molino","Course_ID":"APMA 4300","Course_Name":"Numerical Methods","Review":"The only major advantage that Molino has to offer is that he speaks fluent English. Other than that, the guy is a terror. He is basically only on campus on Mondays, which means that he holds office hours right before class (which is incidentally when homework is due and exams are given). Furthermore, he doesn't post any sort of lecture notes or outline at all and rarely works with nontrivial Matlab in class. Incidentally, he doesn't give practice exams either so you're kind of in the dark to whatever terrors he deigns to throw at you.\n\nMolino and his TAs also seem extraordinarily lazy when it comes to posting solutions to assignments. They usually just scan some student's solutions and pass it off as their own. \n\n          Workload:\n        Weekly problem sets (50% of grade) that he claims should take \"3-4 hours\" but somehow end up taking inordinate amounts of time because they have ~7 problems each. An extremely difficult midterm (20% of grade), where the average was in the 60s. I can only assume that his final (30% of grade) will warrant suicides.","Date":"March 19, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c68" },"Professor":"Nicholas Chong","Course_ID":"HUMA W1123","Course_Name":"Masterpieces of Western Music (Music Humanities)","Review":"Nick was a fantastic Music Hum instructor. I'm surprised he doesn't have a silver or gold nugget! It was clear throughout the semester that he takes teaching very seriously, and that his goal was just for us to learn about classical music. These are always good things in a core class.\n\nI was most impressed by how organized Nick is and how much material he manages to fit into each class. His classroom is truly a well oiled machine. He produces very comprehensive handouts for everything in the course (class content, guidelines for assignments), returns graded work promptly with copious comments, and responds to emails quickly. He was an engaging lecturer and I think, managed to capture the interest of even students who probably weren't inclined to like the subject matter that much. It's clear that he's really into the material, but understands that most people wouldn't normally listen to that much classical music. On another note, it was pretty cool that for the German vocal music we studied, Nick appears to have translated the texts from the German himself. \n\nWith regard to course content, there were a few live performances in the class, which were pretty exciting (Nick is a singer), as well as a trip to the opera to see La Traviata, and to Carnegie Hall for a Wagner recital. \n\nNick is serious about graded assignments-- he'll definitely point it out if you don't back up your arguments or don't organize them clearly. That being said, since this is a core class and all, I think he is fairly lenient as long as a good faith effort is made. Plus, there are many extra credit opportunities. I'm pretty sure that a large proportion of our class received As.\n\nI believe Nick is teaching CC next year, and I think he'll be great. I'm pretty sure he incorporated something about Kant and the noumenal and phenomenal when we talked about Wagner and Debussy (hurray for drawing connections between core classes!).\n\nAnyway, if you get Nick for CC, definitely take the class! It's guaranteed that he'll invest boundless energy into the course and make great efforts to ensure that you walk away from the class enlightened on some level.\n\n          Workload:\n        An ungraded worksheet for each class, four 1-page listening responses due over the semester, one short 3-4 page paper, one 6-8 page final paper, midterm and final exams. Lots of extra credit.","Date":"June 05, 2013"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c69" },"Professor":"Nicholas Chong","Course_ID":"HUMA W1123","Course_Name":"Masterpieces of Western Music (Music Humanities)","Review":"Nick is a great teacher for music hum! He's a singer so you'll be listening to a lot of that in this class. For a 9 am class he keeps you pretty awake with his energy. He is very clear in his explanations and is as nice and lenient as he can be. he's a grad student so he's really understanding and will give you paper extensions if you tell him in advance. Also a smart guy (Yale alum). makes sure the student understands the material and always makes himself available for office hours if you need any help.the workload was fair, we had weekly listening assignments that he went over thoroughly in class before he collected. as long as you put in the effort you'll do well! (class isnt graded on a curve, he says if everyone hands in A-level material, everyone will get an A :) ) All in all i loved taking the class with Nick! He's quite entertaining and I gained much appreciation and knowledge for music. also the trips to the met opera and carnegie hall were definitely worthwhile! So be happy if you have Nick for music hum :)\n\n          Workload:\n        weekly listening, midterm, final\n3 papers - 2 short papers 3 pages each, and one 6-page review of Lawrence Kramer's book \"Why Classical Music Still Matters\"","Date":"January 13, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c6a" },"Professor":"Shahriar Shahramian","Course_ID":"ELEN E4312","Course_Name":"Analog Electronic Circuits","Review":"Absolutely amazing class. Although very challenging.\n\nShahriar is an absolutely amazing professor, he's a great lecturer and cares about his students actually learning the material. That said, there is a lot of material to learn in this class, which covers transitor-level amps and feedback. Most of the learning curve is building a familiarity and intuition with the material, and so it takes a ton of time. Even if it seems simple when he goes through an example in class (he makes it look ridiculously easy) you need to put in time outside of class.\nRight at the beginning Shahriar told the class that we needed to put in 20-30 hours a week in this class, and when we didn't believe him we all failed the midterm. So put it the time.\nHe was nice enough to weigh the second midterm and final more than the first, I don't think anyone actually failed the class although there were more than a few who dropped out.\n\nAltogether, an amazing class that simply takes a lot of work, taught by a an absolutely amazing prof.\n\nShahriar also has a video blog (thesignalpath.com) that has a few gems in it. He's great, one of the best professors I've ever had.\n\n          Workload:\n        2 midterms and a final. Psets that aren't graded, but you'd best do them and redo all the examples from class if you want to understand the material. Lots of study time required.","Date":"January 15, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c6b" },"Professor":"Ana Paula Huback","Course_ID":"PORT W1220","Course_Name":"Comprehensive Intermediate Portuguese","Review":"Comprehensive Intermediate Portuguese\n\nAna Paula is one of the best professors I've had while at Columbia. If you are looking to be fluent in Portuguese once you're done, she is the perfect professor. Her work can be challenging but she will go out of her way to help you if you are struggling. She does every thing in her power to help you succeed if you want to. \n\nIf you are lazy this is not the class for you because she does move quickly and covers lots of material. Many people leave language classes able to read and write but struggle with speaking. If you take Portuguese with Ana Paula this will not be a problem for you.\n\n          Workload:\n        5 5-minute oral presentations, 3 10-minute oral presentations, 7 2-page essays, 5 1-page essays, weekly posts on wikipage, daily book assignments, midterm & final","Date":"January 12, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c6c" },"Professor":"Walter Johnston","Course_ID":"ENGL BC1204","Course_Name":"First-Year English (Workshop): Legacy of the Mediterranean I","Review":"Professor Johnston was a great although inexperienced professor. His goal was to teach us to write at a college level, and I think he succeeded in his goal. I came away from this class with a much better understanding of how to do a close reading of text and utilize it in a paper. I also really enjoyed the texts we read, although I was frustrated that in some cases we only read selections from the books, not the entire things. Professor Johnston was very good at moderating our discussions and keeping them on track, and seemed well-versed and knowledgeable about the information. In particular his knowledge of philosophy and art helped to make our discussions of the text even richer. One of my favorite instances in class was when he invited a friend of his from Princeton to come and give us a guest lecture about architecture in The Aeneid.\nHowever, Professor Johnston was not perfect. Towards the second half of the semester he was continually late to class, a couple times by more than 15 minutes. Also, his feedback on papers was often very difficult to read and attempting to meet with him in office hours was a little hectic since he has to hold them in Liz's Place because his adjunct's office is very small. Some girls in the class felt like he was unclear in explaining how to do close reading and felt frustrated by how he graded their papers but I didn't really have the same experience. Also, he took four weeks to turn in our grades for the class (he turned them in yesterday), which seems a little excessive to me given that we handed in our final papers on the 19th of December and we didn't have any final exams.\nI think as Professor Johnston gains more teaching experience these flaws will iron themselves out and those who take his class in the future will find if they work hard and pay attention they will have a rewarding experience.\n\n\n\n          Workload:\n        1-2 books per week with c. 100 pages assigned per class. At the beginning of the semester each student picked two class days and had to prepare an in-class presentation of the assigned material for that day. (If something came up Professor Johnston was very reasonable about allowing students to switch days) Two 5-page papers and one 10-page paper with rough drafts due a week before the final draft and an opportunity for in-class workshopping.","Date":"January 11, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c6d" },"Professor":["Partha Chatterjee","Sophia Stamatopolou-Robbins (TA)"],"Course_ID":"ANTH V3980","Course_Name":"Nationalism","Review":"If you're interested in the subject, take the class. It wasn't the most exciting one I've taken, but there wasn't anything to complain about either. Prof. Chatterjee knows his stuff, and is always articulate and open to discussion. The texts themselves are really interesting for the most part, and it will change the way you think about Nationalism and how you view contemporary issues. Think the best advice would be to pick a TA who suits you. \n\nI can't vouch for the other TA, but Sophia was great. She's organised and on top of her stuff, almost to a fault, but she keeps discussions light and will make sure difficult concepts are broken down and argued thoroughly. She will push you to think past superficial comments, which keeps things interesting too. \n\nNo regrets taking this class. Liked the subject, professor, and TA. \n\n\n\n          Workload:\n        Heavy, but only because it's weekly. 500 words responses every week on all texts, and a 20 page final paper.","Date":"January 13, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c6e" },"Professor":"Michael Eisenberg","Course_ID":"HUMA W1123","Course_Name":"Masterpieces of Western Music (Music Humanities)","Review":"He’s a nice guy, but he’s trying too hard. He’s a pianist, so he knows music very well--and beyond that, not much else. We learned almost nothing because he didn’t know how to teach with the readings: he basically just repeated the book and then talked a lot about musical jargon that no non-musicians understood. I appreciated his knowledge, but gave up trying to follow along pretty quickly.\n\nEisenberg often talks for twice as long as he needs to, and this definitely adds up; we got out of class 5-10 minutes late almost every day, and class was already supposed to end at 7:30. He does the same thing with assignments, writing overly wordy and confusing essay prompts and vocabulary IDs that are hard to study. His midterm/finals were a little ridiculous: Music Hum was my most difficult final. This should just not be allowed to happen.\n\nThe second half of the class was all student presentations and guest performances. He prepared us for the final not at all, and the same goes for the other assignments. We also got no comments on our midterms, which meant that we were pretty much on our own for the final (he didn't prepare us and the book is your only hope).\n\nI want to give him credit for really wanting to do well. But the truth is, if I knew what I was getting into, I would have immediately switched sections. Music Hum was my only Core dud.\n\n          Workload:\n        Midterm/final are incredibly long and complex; expect everyone else to be shocked when you tell them what will be on it (hint: over 50 vocab IDs, 3-4 papers with minimum two and a half page length, and at least 10 listening IDs from the whole CD set). \n\nPapers: a concert review and an opera report. Non-musicians have to struggle to please him by name-dropping musical terms.","Date":"May 21, 2013"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c6f" },"Professor":"Michael Eisenberg","Course_ID":"HUMA W1123","Course_Name":"Masterpieces of Western Music (Music Humanities)","Review":"You know how there are those professors who are really unorganized but their class is still phenomenal and you learn a lot?\n\nMichael Eisenberg is not one of those professors. He's very smart and very talented, but his music hum class was literally the least organized class I have ever taken at Columbia. He would assign readings from the book, but all we would do in class was analyze little snippets of songs or have in class performers. I think he demanded too much from us in the sense that he wanted us to be able to analyze music, but most of us did not have any kind of background in music and were unfamiliar with music theory. What was really irritating was that the exams tested the stuff from the book (more historical context type things) but we hardly ever even went over it in class. The final was the most poorly designed test I've ever taken. He gives you 4 cds of music to memorize and be able to identify by ear, in addition to four short essays, and vocab (he gave us over 120 possible words, 50 appear on the test, and you only have to answer 25). If you can switch out, DO IT, but if you can't you'll survive. Just do well on the concert reports and participate a lot, he'll think whatever you say is profound.\n\n          Workload:\n        Concert report, opera report, midterm, final, discussion posts that nobody gave two shits about.","Date":"May 15, 2013"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c70" },"Professor":"Michael Eisenberg","Course_ID":"HUMA W1123","Course_Name":"Masterpieces of Western Music (Music Humanities)","Review":"Eisenberg is very knowledgeable, I will give him that.  However as a teacher, he is EXTREMELY unorganized and I felt that he expected too much music theory knowledge.  It was not uncommon to receive several emails over the span of a few minutes correcting information.   We barely followed the text and the majority of the second half of the semester was in class presentations or performances that did not help prepare for the final at all.  That being said, grading is pretty lenient if you follow the rubrics closely (use sheet music for the reports if you can read music, it helps a lot).  If you can switch out of this section, do it, but if not it's tolerable. \n\n          Workload:\n        Midterm, final, concert report, opera report, in class presentation, weekly postings that nobody does.","Date":"May 13, 2013"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c71" },"Professor":"Michael Aufrichtig","Course_ID":"PHED C1001","Course_Name":"PE Fencing","Review":"The review before this captures the class perfectly. The only difference is that during my year we didn't have to follow international fencing scores and I managed to convince Michael to make our final take home. Best class ever. He would meet up before class with students who wanted extra practice and even gave a few make up lessons before/after class to students who missed class. Electric fencing is mad fun. One day he had his students teach the class because he was absent, I found this super fun as we mostly did fitness exercise that the varsity fencing team does. I wouldn't say my whole class enjoyed that aspect though hehe. One of my most enjoyable experiences was when he invited us to attend the yearly home match of the Columbia Fencing team. Since we already had an experience with electric fencing, we truly appreciated the talent the varsity fencers have. Those people are freakin ninjas!!! and truly entertaining. \n\nTAKE THIS CLASS YOU WON'T REGRET IT!!!\n\n          Workload:\n        Show up, google a random fact, google stuff to complete a take home final (aka, middle school worksheet!)","Date":"December 25, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c72" },"Professor":"Jennifer Hom","Course_ID":"MATH V1201","Course_Name":"Calculus III","Review":"Professor Hom acts like an adorable 10-year-old who actually does an excellent job teaching you calculus. Her class is pretty much all I could ask for in a math course: straightforward, fair, and curved fairly generously.\n\nShe teaches very methodically, and even though the notes she writes on the board are fairly similar (if not identical) to the textbook, she does an effective job teaching you the material. I had never taken multivariable calc before (just BC calc in high school) so almost everything we learned was new to me. Yes, I'll admit the lectures aren't always the most engaging, but it's a math class – how much flexibility does the professor have in terms of being creative? She teaches the theory and then works out example problems. When things get boring, or if she makes a mistake, she tells us a Chuck Norris joke or a funny story about her niece. It's adorable.\n\nThe exams are pretty fair. The first exam was definitely trickier than the second exam, which was as straightforward as you could possibly imagine. The final was definitely tougher than the midterms, with the average being around a 66%. However, there was a very generous curve for everyone's final course grade, as even people who had an average of a little over 85% uncurved ended up with A's. If you do your homework (which we affectionately referred to as Homwork) and actually understand what you're doing (not just copying from Chegg), you'll have no problem with the exams. I never went to Hom's office hours since I just checked my homework with and asked questions to friends of mine in the class.\n\nOverall, JHom is a great choice for Calc III. TAKE HER CLASS AND ENJOY THE CHUCK NORRIS JOKES!!!\n\n          Workload:\n        2 Midterms (Each 20%), 1 Final (40%) and about 20-30 homework problems per week (Total of 20% of course grade). The homework does take a couple hours but I think it appropriately reinforces the material. Honestly, it's not too much, nor is it too little.","Date":"December 25, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c73" },"Professor":"Jennifer Hom","Course_ID":"MATH V1201","Course_Name":"Calculus III","Review":"Ok, so I'm not going to say that she's the best teacher in the whole wide world, but she's probably the best Calculus 3 teacher at Columbia in terms of helpfulness and clarity.  I really didn't catch on to her much (as a teacher) at the beginning, but she missed one day and another professor taught in her place, and suddenly I realized how lucky I was to have Hom.\n\nShe's brilliant at math, and she is extremely helpful in her office hours.  She assigns a lot of homework and her favorite problems are the \"post-40's\" in the math book, i.e. those towards the end of the chapter that are lengthy and conceptual, so at times they can be somewhat esoteric and difficult to understand.  GO TO HER OFFICE HOURS IF YOU ARE STRUGGLING, SHE'LL MAKE SURE YOU GET IT.  \n\nAs far as tests go, her initial test averaged a 45/60 and her second a 51/60.  In all honesty, the first one was pretty brutal but the second one was very straight-forward and easy to understand if you did your homework.\n\nTake Hom, she's not bad!\n\n          Workload:\n        2 midterms (20%), one final (40%), lengthy problem sets (20%, 3 problems on each graded randomly... check for accuracy or your grade will suffer..  lowest homework grade dropped)","Date":"November 13, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c74" },"Professor":"Jennifer Hom","Course_ID":"MATH V1201","Course_Name":"Calculus III","Review":"TAKE JENNIFER HOM!!!! She explains math like we are a class of 5th grade students, which is largely appreciated when the topic is multivarible calculus. For this same reason, she is quite adorable in class and commonly tries to integrate chuck norris jokes and stories about her niece into her lecture. Even if everyone is not a fan of her psets, they love Hom as a person. \n\nThe book explains calculus rather well, and you can pass the midterms/do all the psets without ever going to lecture, but go to lecture anyway. She explains calc better than the book does, she goes over practice problems that come up in the psets but are not explained in the book, and you'll actually save time by going to lecture vs skipping. She rarely asks for student input during lectures and when working out problems. This is really nice as you probably forgot a lot of trip/calc I/Calc II, but she also reviews the calc I/trig needed for certain topics. That being said, sometimes her lectures are really fast (with absolutely no bullshiting!) and you can easily get lost. Thankfully, she will stop to answer any question. Once a student said \"CAN YOU PLEASE SLOW DOWN!?!!!!!\" and instead of being offended, Hom completely stopped where she was, and went through the steps very slowly, re-explaining each part. So if you don't get something through lecture, its generally your fault; ask questions, or she will assume you get it. Oh, Sometimes her classes get out early =)\n\nOffice hours are very useful and she will hold midterm review sessions on some of those offices hours, going to one saved my ass on a midterm after I had skipped lecture for a few weeks. \n\nShe doesn't use webassign!!!!!! WOO!!! Though sometimes the grading by TAs makes absolutely no sense; like once I got a 8/20 on a pset I thought I did genuinely well on, another time I got \"bro, I can't read your handwriting\" was rewarded with a 6/20 (p.s. I could read that shit!). Despite my horrible pset grades and bad final (understood all the material but didn't memorize the necessary formulas, did well on midterms) I still passed the class. \n\nYou will have no clue what your letter grade for the class is during the semester and you are just going to have to live with it.\n\n One last note, there is no arguing about a grade on a midterm. I (and others) went up to her after the midterms were passed back to dicuss the partial credit we recieved and every response was the some variation of \"well yes, but you didn't do that so this is the credit you recieve\". Sometimes frustrating, but of no great consequence. If you want a calc teacher that explains the topic very well, gives a reasonable workload, doable midterms/finals, and is accessible, take Hom! \n\n          Workload:\n        Not bad at all if you are a SEAS major, pretty horrible if you are an econ major. There is a pset due every week and the problems are announced well in advanced on her website. They usually take about 2-3 hours and are really straightforward with the exception of 1-2 problems at the end (again, some will rant that the psets are ridiculous, but those people have never taken physics). The method to solve these harder ones are usually explained in lecture but not in the book; regardless, a trip to office hours will save you much headache as she will explain how to solve any problem. There are 2 midterms that are rather easy if you memorize the formulas/know when to apply them, but as mentioned in the review before, have a multiple choice section that requires a true understanding of the material. The final was a rather difficult, but the class had a VERY generous curve.","Date":"December 25, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c75" },"Professor":"Jennifer Hom","Course_ID":"MATH 1201","Course_Name":"Calculus III","Review":"Jen Hom is an ok professor. Not the greatest but not the worst. Her class gets kinda boring at times though. The material itself isn't really hard. There is DEFINITELY a lot of material though, so I would not recommend cramming for a test on the night unless you're a math whiz or already learned this material in high school. Be prepared for a lot of hw if you want to take this class. And by a lot, I really do mean A LOT.\n\n          Workload:\n        weekly hw sets (roughly 20-25ish questions each), 2 midterms, 1 final","Date":"November 01, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c76" },"Professor":"Jennifer Hom","Course_ID":"MATH V1201","Course_Name":"Calculus III","Review":"Professor Hom is completely adorable. She taught the material like it was a fifth grade class, which can seem unnecessary at times but pays off in the end. The tests in this class were very easy. The average was high both times, and I (by no means a math genius) was able to pull off above a 55/60 on both midterms by completing the homework assignments and studying minimally. Professor Hom was more than fair in her preparation and grading, and she told us exactly what to expect before both midterms and the final. However, a word of caution: since the tests are so easy, the class average was very high, and Professor Hom still curved to a B or B+, so I got an A- with an un-curved average of a 90%.\n\n          Workload:\n        Weekly problem sets that are partially graded for correctness.","Date":"April 18, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c77" },"Professor":"Jennifer Hom","Course_ID":"MATH V1201","Course_Name":"Calculus III","Review":"A fantastic professor. Taking her course made me consider majoring in Applied Math.\n\nEvery day, she would lecture us by giving us clear, and helpful notes. Although her notes were very similar to the textbook, it was very helpful going through all of the material with her. She would also give us extremely helpful practice problems that were great when we were studying for the midterms and finals.\n\nHer class was boring at times, but it was definitely more helpful to attend her class than skip the lecture even though you could learn the same material from the textbook. I had to do this once, when I skipped a lecture, and I regretted it.\n\nJen Hom is basically my home-girl. Take this class!\n\n          Workload:\n        Weekly problem sets, two midterms, and a final.\n\nHomework: 30%\nTwo Midterms: 20% each\nFinal: 30%","Date":"January 18, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c78" },"Professor":"Jennifer Hom","Course_ID":"MATH V1201","Course_Name":"Calculus III","Review":"Hom is all around a pretty good professor. She explains things better than the textbook and thus makes going to class worth it, even if you REALLY REALLY REALLY don't want to...which was me most of the time. \n\nIf you take her class though, be prepared to really understand the material. No longer can you just memorize formulas. You have to really get it. Her true-false questions and sometimes-always-never questions on the exam insist on it. \n\nHer class is not an easy A. Her exams are kinda hard. Her final was soooo long. But whatever. Those days can suck. If you want to really understand calc III (but really though, why would you?), Hom is your lady. \n\nLong story short--I am not a math person. I did ok. You can too. Hom is a pretty good professor. She talks about her niece a lot.\n\n          Workload:\n        Weekly hw (actually, these were SUPER long, but she uses a lot of odds thank god), two midterms (kinda hard, not awful, nice curve), and a final (same as midterms, but SO SO SO long. god. 13 pages. WHY.)","Date":"December 19, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c79" },"Professor":"Jennifer Hom","Course_ID":"MATH V1201","Course_Name":"Calculus III","Review":"I like Jennifer! I mean, she's by no means the most inspiring teacher in the world, but she's very sweet and presents the material very clearly. More than that, she's very straightforward about what she's looking for from her students. I was a little frustrated by a few of my homework grades -- homework is graded on correctness, but only three of the problems are actually graded, so if it just happens to be the three problems you didn't know you're completely screwed. Also, the TAs grade, which obviously gets messy at times. However, if you are taking this class to meet a requirement, I'd definitely recommend Jennifer Hom -- you'll learn a lot with minimal stress.\n\n          Workload:\n        Weekly homework, 3 exams, 1 final -- some of the problem sets are difficult and lengthy, but other than that very low stress","Date":"May 14, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c7a" },"Professor":"Joshua Mailman","Course_ID":"HUMA W1123","Course_Name":"Masterpieces of Western Music (Music Humanities)","Review":"Very simply, if you want Music Hum to be an easy class drop/do not register for Mailman. This guy seemed to be on a mission to make this class a huge part of our lives this past semester. For every class, he expected that we would go through his homework assignments (literally 3 hours long) to prepare. He doubled/tripled the amount of music that we were responsible for by adding his own songs to the already challenging amount presented in the textbook. When preparing for exams, I would have 8 hours of music on iTunes that I had to be able to identify. Would study all night to maybe get half of them right. Ultimately, 90% of the class did not do the work. He can also be very annoying. For example, was angry when people showed up late when it was literally blizzarding outside. Decided he would start taking points off for coming in late and then suddenly stopped. Would get mad when people asked him to write larger. One thing that was cool was when he brought in a live jazz demo to perform for us. I really like jazz and was looking forward to this part of the class. We actually did not cover any jazz in class because he messed up and got way behind on the syllabus. This of course did not stop him from putting several questions, including an essay, on jazz in the final. When the jazz group came to perform, another music hum section came in to watch it with us. Their professor seemed to be a really cool PHD student. I asked myself, \"Why couldnt I be in that section?\". Being so behind on the syllabus, we did not cover several of the composers of the 20th century. A reasonable student would assume that he would not test much on what he didnt cover. WRONG. These composers popped up all over the final. The final: 1. He said that the final would cover everything from the classical through the end of the semester. In actuality, it was probably 75% stuff from the final two weeks of the semester that he floored it through and 25% everything else. 2. The final was absurdly long. Listening ID with ~25 questions. Multiple choice and short answer. Multiple choice questions. And 2 full length essays. Everyone took  nearly the full 3 hours to do the exams. I talked to friends in other Music Hum sections, their finals maybe had a listening section and 1 essay that took them an hour and a half usually. All in all, Mailman is a huge ass and you should not take this class unless it is literally second semester senior year and you need it to graduate. If not, wait for an opening in that cool PHD student's section. \n\n          Workload:\n        Daily homework which he doesnt collect but expects you to do (~6 hours per week) , 2 midterm \"quizzes\" , 2 concert reports, 1 ridiculous final","Date":"May 23, 2014"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c7b" },"Professor":"Joshua Mailman","Course_ID":"HUMA W1123","Course_Name":"Masterpieces of Western Music (Music Humanities)","Review":"The tone of the 2 reviews reviews is not quite right imo, so some more info could be helpful. \n\nProfessor Mailman did assign *way* too much work. He added an entire supplementary curriculum to the textbook and seemed to think it was reasonable - doing all of it would have taken a number of hours for each class. Coupled with the oft-held perception that Music Hum is easy, this definitely pissed people off and I was frustrated at times too with an assignment that was just way too long. \n\nOn the other hand, success did not depend on doing every single bit of work. Also, I found listening to the pieces to be fun, and the times when I was even somewhat conscientious to the textbook and additional stuff, I found myself learning a ton. His curriculum was well-designed, and he took lots of question in class. At times his flexibility made things confusing because he was too nice to shut people down. \n\nI agree with the below reviewer that he was the hardest working professor I have had at Columbia. I often felt guilty for not putting in even a modicum of the effort that he was, and he is passionate about the music and teaching. He is a bit of an oddball but I found his humor awkwardly hilarious. He is definitely some sort of musical genius. \n\nLastly (and, to be fair, at least in part because of the copious amounts of assigned work), the Fall 2013 class was a terrible one. 80% of the class did none of the homework and never spoke in class, and he would often get frustrated with complainers about grades. the few people who did participate ranged from honestly curious to insufferably know-it-all. \n\nall in all, I bet you could do a lot worse than Professor Mailman, but expect to put more time in than you might expect for Music Hum to be successful.  \n\n          Workload:\n        2 concert reports, 2 quizzes, final, and participation. \n\nTextbook text+listening and supplementary listening+guiding questions. Quizzes and Final had annoying multiple choice section with randomly specific questions cherry-picked from the reading.","Date":"January 21, 2014"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c7c" },"Professor":"Joshua Mailman","Course_ID":"HUMA W1123","Course_Name":"Masterpieces of Western Music (Music Humanities)","Review":"Worst professor I've ever had at Columbia. Or anywhere. \n\nAs someone with a very intense musical background and intense musical appreciation, taking Music Hum with Professor Mailman actually made me like music less. This is not to say that Professor Mailman is not a hard-working professor who deeply cares about the material--this is to say that Professor Mailman brought an intensely arrogant attitude to our biweekly classes. He was very weirdly misogynistic which was extremely off-putting not to mention a dick. He came in with an attitude that everyone understood the jargon he was using even though my classmates were for the most part non-musicians. As a musician I felt alienated by Professor Mailman--I cannot imagine what my peers were feeling when he would throw around expert musical jargon and expect everyone to follow what he was saying. That said, classes were thoroughly thoroughly boring. Professor Mailman spoke in a monotonous (but simultaneously cocky) tone for a good hour and a half every class. He assigned a shitload of work that no one actually did and then he looked mad when he realized no one listened to the three hours worth of music he put on Courseworks. No shit. \n\nProfessor Mailman also focused a great deal (too much) on the theoretical aspect of music. We spent three classes on Sonata Form and we didn't really talk about the ways in which music is a deeply personal, intimate experience. He made learning about music the opposite of enjoyable. \n\nIf you get him as a music hum professor, SWITCH OUT. I am serious. Do it for you--don't make the mistake I did and stick it out with him for a semester. \n\n          Workload:\n        2 papers, online quizzes that did not make any sense, final.","Date":"May 07, 2015"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c7d" },"Professor":"Joshua Mailman","Course_ID":"HUMA W1123","Course_Name":"Masterpieces of Western Music (Music Humanities)","Review":"Coming from someone with a musical background, you should drop this class immediately.  Not only does he expect you to be able to identify every single piece in the textbook, but he just about doubles that amount with outside material of his own.  Very disorganized - we were way off the syllabus, lectures were disengaged, and his courseworks is a mess.  He switched how he posted assignments halfway through.  No one knew any of the IDs on the final - he played obscure parts from obscure songs.  Save yourself hours of work and switch sections.  Really disappointing for a class that I was really looking forward to.\n\n          Workload:\n        Listen to all of the songs he posts and textbook readings, 2 concert reports, 2 tests, final.","Date":"December 17, 2013"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c7e" },"Professor":"Joshua Mailman","Course_ID":"HUMA W1123","Course_Name":"Masterpieces of Western Music (Music Humanities)","Review":"I disagree with the reviewer below. While he does ask you to listen to many of the pieces in the textbook, if you can figure out a specific characteristic of each piece, then it shouldn't be too hard to identify them even if the most \"famous\" part of the piece isn't played. \n\nAs for professor Mailman himself, he is by far the hardest working professor I've ever had at Columbia. Not only does he create his own videos to help us understand the materials, but he also creates study questions for the quizzes that show up word for word on the quizzes and final - he even said so himself! The tremendous amount of work he puts into making the class as good as possible is how every professor should do it. I am very glad that I ended up in his class, as he is a very nice professor and you will definitely come out of his class with a very deep understanding of the music.\n\nP.S. He treated us to pizza and milkshakes after we watched the opera.\n\n          Workload:\n        Listening and reading for every class, 2 concert reports (3-4 pages), 2 quizzes (45 mins each), final.","Date":"December 20, 2013"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c7f" },"Professor":"Daniel Dipaolo","Course_ID":"HUMA W1123","Course_Name":"Masterpieces of Western Music (Music Humanities)","Review":"I completely agree with the other reviewers. The class is basically all about how much you appreciate music. Participation didn't matter, but I think everyone talked at some point, because Prof. DiPaolo really has the ability to make the class atmosphere comfortable. I remember a couple people would doze off in the back row, but he never picked on them. \n\nSuper funny, quirky, intelligent. I wish I could take some other classes that he teaches.\n\nMore than recommend his class.  \n\n          Workload:\n        Three 2-3 papers. Super light midterm and final. Our final was on the last day of class (FTW!!!!)","Date":"September 02, 2013"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c80" },"Professor":"Daniel Dipaolo","Course_ID":"HUMA W1123","Course_Name":"Masterpieces of Western Music (Music Humanities)","Review":"Hands down one of my favorite professors. He is quirky, funny, and extremely flexible with the work he hands out. I heard from some other Music Hum students that their teachers were a pain in the ass, requiring complex analysis and identification of musical terms. Dipaolo wasn't anything like that. In fact, I felt that he was too easy sometimes. \n\nIncredible passion for music, and extremely knowledgeable. Learned a lot, and would retake the class in a heart beat. \n\n          Workload:\n        2-3 three page essays. These are basically like observation notes.","Date":"July 29, 2013"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c81" },"Professor":"Daniel Dipaolo","Course_ID":"HUMA W1123","Course_Name":"Masterpieces of Western Music (Music Humanities)","Review":"This class was the most hysterical class ever!  I was in a class made up of mostly musicians, but even compared to the other classes made of up musicians that I talked to, our workload was super, super light.  Prof. Dipaolo definitely had interesting insights, and I feel like I did learn from the class somewhat.  However, much of the class consisted of simply listening to music, or else, trying to get the speakers to work, or else, complaining about how the speakers never worked.  In discussion, we had a few people who already knew everything, and a few who hated the people who already knew everything, which always made for free entertainment.  And Prof. Dipaolo always had some amusing thing to show or play us (an electronic version of Rite of Spring, for example), so overall this was my most enjoyable class.  Prof. Dipaolo is the nicest guy ever, and I cannot imagine that anyone didn't get an A.\n\n          Workload:\n        Three 2-3 page papers, no midterm and an IN CLASS final.  An occasional quiz.  Light, light, light.","Date":"December 29, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c82" },"Professor":"Ashley Nail","Course_ID":"HUMA W1123","Course_Name":"Masterpieces of Western Music (Music Humanities)","Review":"Music Hum with Ashley Nail was a dream. Ashley is an AMAZING teacher, and probably one of the best instructors I have ever had at Columbia, even being a grad student. She consistently made the class fun, both for people with extensive music experience and for people with none.\n\nShe really knows how to explain things in a way that make sense and in a way that you will remember and be able to talk about for years to come. She made sure all of us could make small contributions to the class discussions, and she introduced us to all sorts of cool music that was off the syllabus, as well, which was really neat. Her offbeat humor and cat lady jokes made waking up for 8:40 class totally worth it.\n\nShe did her lectures so well and also prepared us so explicitly for all of the assessments that if you kept up with the readings enough you could get great grades on all of the quizzes and papers. She also had all of the readings photocopied and put on Courseworks, so we didn?t even have to buy the textbook, which was great.\n\nI?m so glad I got put in Ashley?s section. It was the greatest Music Hum experience I think I could have hoped for, and I would consider anyone who gets into it really lucky.\n\n          Workload:\n        20-30 pages of reading per week\n8 short quizzes based on readings\n5 short papers (1-2 pages)\nFinal\n\nNO Midterm","Date":"December 20, 2014"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c83" },"Professor":"Ashley Nail","Course_ID":"HUMA W1123","Course_Name":"Masterpieces of Western Music (Music Humanities)","Review":"Ashley is amazing.  She puts a lot of time into preparing for the class, and has genuine enthusiasm for helping people understand the basics.  For example, she takes the time to photocopy the textbook so that you don't have to waste your money on it.  She gives quizzes once a week or so with review sheets so even when I felt lost (I have no music background) all I had to do was focus on those directions and I was more than fine.\n\nShe brings energy and appreciates participation.  I made myself raise my hand at least once a week so she knew I was giving an effort.  I know that I didn't bring a whole lot to the discussion, because some of the other students had a much larger working knowledge of music, but Ashley made it clear that she wanted us to comment when we could.\n\nI've heard from friends that they've not had the same pleasant experience as me with this class in particular so I'm grateful I had Ashley.\n\n          Workload:\n        10 quizzes, two small papers, midterm, final.  She tells you exactly what to study for, so it's pretty stress free.","Date":"May 01, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c84" },"Professor":"Ashley Nail","Course_ID":"HUMA W1123","Course_Name":"Masterpieces of Western Music (Music Humanities)","Review":"Ashley was hands down one of the best teachers I have ever had. In all my time at Columbia, as well as in high school, middle school, primary school and yes, even Kindergarten. She brought tremendous enthusiasm to the class, an incredibly contagious enthusiasm that showed in her lectures, homework, grading and exams. I loved going to class because of her great personality. She made me laugh every single class period, while at the same time amazing and enthralling me with the syllabus pieces and her knowledge of them. She was insanely structured, which made the class easy to follow and extremely accessible. I loved music humanities, and Ashley made it an experience that will stay with me until death. \n\n          Workload:\n        10 Quizzes (Not hard at all if you follow her study guides), 1 Final (A lot of writing but extremely fair and easy to study for), Extra Credit problem set, No midterm. Really great class to take it easy while at the same time learning a ton.","Date":"May 21, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c85" },"Professor":"Aftab Ahmad","Course_ID":"MDES 1614","Course_Name":"Urdu for Heritage Speakers","Review":"Prof. Aftab is the best professor I've had at Columbia! Take the class if you're a heritage speaker, take Elementary Hindi-Urdu with him if you're not. You'll learn so much about the language, culture, life in general, philosophy, morals, ethics and Aftab himself. It's probably because this class meets four times a week that you get to know him and his thoughts so intimately (plus the fact that it's a yearlong), but this class is incredible. \n\n          Workload:\n        Really up to you. Short homeworks daily, midterms and finals are very easy - he makes sure the class is more fun than pressure, but he expects you to put in effort regardless.","Date":"May 20, 2015"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c86" },"Professor":"Aftab Ahmad","Course_ID":"MDES W1610","Course_Name":"Elementary Hindi-Urdu I","Review":"Professor Aftab is the best professor I have had at Columbia. Take his class! He truly cares about teaching the language than the whole grading curve crap. His grades according to how much work you put in and how much you improve which is very nice of him because learning a language is different for everyone. If you attend his office hours, it shows him that you care which in return boosts your grade. Overall if you really want to learn urdu and care about the language/culture it is pretty easy to get a goof grade in his class.\n\n          Workload:\n        1 midterm and 1 Final. homework everyday that he collects but is generally not too difficult. He looks for improvement in the hw so when he hands it back look at your mistake.","Date":"January 08, 2014"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c87" },"Professor":"Aftab Ahmad","Course_ID":"MDES W1610","Course_Name":"Elementary Hindi-Urdu I","Review":"Aftab ji is awesome! He's a good teacher, though in a fairly subtle, quiet way - I feel like he always wants to make you feel you've arrived at it yourself rather than being taught, which is lovely and takes some pressure off. He's got a good sense of humor and will fairly frequently mix it up with Hindi songs or poems or his own reading comprehensions, so classes are fun. He always grades on time and is extremely happy to explain anything in his own time if there's something you don't understand. He's also just a great person and I hope I can take another class with him again. \n\n          Workload:\n        Not hard, especially considering that this is a 5-point class. Short homeworks - 20 minutes, probably - due every class. Usually grammar exercises but occasional compositions. A couple tests of grammar and vocab which aren't hard. You might occasionally need to take the initiative and re-teach a few things to yourself if you forget, but the materials make that easy.","Date":"December 27, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c88" },"Professor":"Aftab Ahmad","Course_ID":"MDES 1614","Course_Name":"Urdu for Heritage Speakers","Review":"Truly and by far the best language instructor I have EVER had. I have taken classes in 9 different languages since I was a child and he truly is the most gifted, patient, and talented instructor I have ever had. \n\n          Workload:\n        medium...as expected","Date":"September 24, 2016"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c89" },"Professor":"Aftab Ahmad","Course_ID":"MDES W1610","Course_Name":"Elementary Hindi-Urdu I","Review":"I took both 1 & 2 sessions of Hindi-Urdu in Summer with Aftab-ji, and I have to be very honest:\n\nHE IS THE BEST PERSON AT COLUMBIA!!!\n\nTake his class! You won't regret! He is super patient and nice and cares so much for his students. He is also passionate about Urdu poetry and shares many beautiful verses with his students. \n\nNothing is easy A at Columbia but Aftab is definitely the person who really wants to give you an A! Just do the homework and get some preparation before the test, he even gives you plenty of hints if you forget anything. What else could you ask? \n \nOverall, I've learnt so much not only about the beauty of the language but also the culture and literature etc. Just take this person's class and I promise you that it would be the best decision you make at Columbia!\n\n\n\n          Workload:\n        very light. It was a summer session so we finished things mostly in classroom.","Date":"July 18, 2016"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c8a" },"Professor":"Aftab Ahmad","Course_ID":"MDES 1614","Course_Name":"Urdu for Heritage Speakers","Review":"Professor Aftab is excellent! He structures the course well, reviewing the very basic at the beginning and picking up the pace as the semester progresses. Over time, he incorporated more reading such as news articles and longer/more difficult passages. The spring semester of UFHS was more work than the Fall semester but it was definitely more enjoyable as well. I picked up so much vocabulary and many grammar constructions. Taking it a yearlong instead of just the Fall definitely improved my speaking and listening skills because at the end of the Fall my reading and writing improved quickly but listening to news and having conversations or debates with good vocab was still difficult. After UFHS with Aftab, you'll be ready for the world! You don't just learn Urdu, the interesting topics covered in the class expose you to an array of different thoughts and give you a new angle to look at and understand life and many cultural issues central to South Asia. \n\nDo note that how much you learn in this course depends on how much effort you put in. Some people wrote a paragraph for daily homework for example that for analysis of a passage and some wrote 2 pages. If I liked a topic in particular I sometimes spent an hour or two writing my views on something because I would read up on it and look up urdu words etc. \nMake the most of it. Aftab is great and so is urdu literature. \n\n          Workload:\n        class held 4 days a week with daily homework assignments. Midterm. Final. journal/2 pages in urdu on any topic due weekly. quizzes  (almost) weekly.","Date":"May 28, 2016"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c8b" },"Professor":"Andrew Fanoe","Course_ID":"MATH W1003","Course_Name":"College Algebra - Analytic Geometry (Precalculus)","Review":"Andrew was a wonderful instructor. He was a very effective, knowledgeable, and caring instructor who was eager to teach and help his students improve. When students had questions during the lecture, he always made sure to answer questions as thoroughly as he could. Even when the answers to some questions were clear to him and other students, he never showed signs of frustration or annoyance when a particular student struggled with a concept and was happy to answer questions. He constantly showed signs of trying to improve and adjust his teaching style so that his students could have good experiences in the classroom. I got a strong impression that he really cared about teaching.\n\nAndrew was always very reasonable and understanding. Although I've often felt distanced from my other professors, Andrew was a very approachable and likable instructor. I liked him because I felt like he could relate with us and knew what worked and what didn't, and what students like and don't like. \n\nHe was a great communicator both inside and outside of the classroom: he clearly conveyed his teachings and was skilled at explaining both simple and complex mathematical concepts. Outside the classroom, he utilized e-mails and provided detailed updates and administrative announcements that I found to be very helpful. \n\nI enjoyed this class very much and would rank Andrew in the same tier as my other experienced professors. There is no doubt in my mind that Andrew will someday become a fantastic professor that students will love (he is currently a PhD student).\n\nThe reviewer below didn't do so well in the class, I presume.\n\n\n          Workload:\n        Very reasonable. Weekly HW, 2 midterms, and a final that were all reasonable and very doable.","Date":"May 26, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c8c" },"Professor":"Andrew Fanoe","Course_ID":"MATH W1003","Course_Name":"College Algebra - Analytic Geometry (Precalculus)","Review":"Ladies and Gents. \nMr. Fanoe is a nice person. He is friendly and kind though socially awkward, as many other mathematicians. \nWith that being said, he has a lot of work on honing his teaching skills, considering he intends to be a professor. His writing on the board is impressively small, and he is as disorganized as any brilliant mathematician. Sadly, he is usually not aware of the fact that most of the class isn't really keeping up with him. \nHonestly, studying with him was frustrating because he takes things for granted, things that precalculus students usually do not know. His class is badly structured, he skips fundamental stages, which makes it hard to understand his work and every now and then he will cram a lesson's worth of material in the last five minutes of class and another four minutes of your break. \nHOWEVER, if you are ok in math, you can do extremely well. \n\n          Workload:\n        One short problem set per week. (10-15 exercises)\nFair tests. Two midterms and a final.","Date":"May 09, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c8d" },"Professor":"Clement Hongler","Course_ID":"MATH V2500","Course_Name":"Analysis and Optimization","Review":"Pros: I actually ended up enjoying this class.  You learn some neat theorems and basic analysis for optimization problems, and by the end I felt very knowledgeable on the topic.  After all of the math and stats professors that I've had at Columbia, Hongler has definitely been the best - both personality/approachability wise, and teaching wise.  I always sat in the front row so I could laugh at his jokes and ask questions when I was lost (which was rare, because he explained things well, drew graphs, used examples).  \n\nCons: The main con was the homeworks.  They tended to be long with several proofs.  He also sometimes introduces some new theories and techniques in them which he expects you to know for the exams.  I just went every Friday to the TA's office hours (*they have the homework solutions*) and tried to work out the problems as a group.  I definitely felt more comfortable with the material after doing them.  Also, there are a lot of theorems, but they all kind of make sense / extension of derivative/tangent line stuff we did in calc.  \n\nAlso don't even bother using the online textbook he links to - its honestly useless.  I never looked at it.\n\n          Workload:\n        P-set every week totaling to 10.  quiz, midterm, final.  similar to the practice exams he posts online.","Date":"May 16, 2014"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c8e" },"Professor":"Clement Hongler","Course_ID":"MATH V2500","Course_Name":"Analysis and Optimization","Review":"Make no mistake, Hongler takes no distinguishable joy in teaching and puts in very little effort. However, he is an above average teacher (deserving of his silver nugget IMO) and his classes are never entirely boring. Even if you half pay attention, you will learn in his class. Some lectures he comes across as extremely lucid and other classes you are left wondering how all the methods he taught fit the puzzle. He is nice, amiable, and willing to explain. Just don't expect him to go the extra mile.\nHe covers difficult topics fairly quickly, and he uses homework as a teaching tool rather than a reinforcing mechanism. Naturally, problem sets spanned the gamut from very difficult to mind numbingly easy. He does teach everything that shows up on the exams, whether through the HW or through lecture. You'll need to think outside the box on the harder questions though, and bring together various theorems. The material is not difficult (nor is it a breeze), but if you're new to the subject it can seem overwhelming.\n\nWould I take him again? Personally, I would.\nIs he a good teacher? Not particularly excellent, but not at all bad. You could do a lot worse. He gave us the famous \"the limit does not exist!\" Mean Girls problem on one of the questions.\nIs he a lenient grader? Yes, he tends to give as much credit as he can on the exams, as long as you write something relevant.\nDoes he curve well? Word on the street is that he curves generously.\n\n          Workload:\n        12 Problem Sets, 1 quiz, 1 midterm, 1 final. Problem sets are not always straightforward.","Date":"May 14, 2013"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c8f" },"Professor":"Clement Hongler","Course_ID":"MATH V4062","Course_Name":"Intro to Modern Analysis II","Review":"I had a terrific time in Prof. Hongler's Analysis II class.  He is very genial and approachable, and he tries to make sure that the students understand what is going on, even if that means spending some extra time reviewing material from previous lectures.\n\nIn terms of logistics, this class is run in a pretty standard way following Rudin's book.  That is, there are weekly homeworks (consisting of about 3-4 problems each, from the book), 2 midterms, and a final exam.\n\nFor the exams, he had more questions than there were available points, so you could choose which ones to answer.  That being said, he did not make all the \"extra\" questions impossible, as some professors are wont to do.\n\n          Workload:\n        Weekly homework (11 total), 2 midterms, Final","Date":"January 09, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c90" },"Professor":"Sam Bloom","Course_ID":"FREN BC1203","Course_Name":"Intermediate French I","Review":"Sam Bloom was an amazing Intermediate I professor. He's quirky and has an all-around comforting presence. I never felt overwhelmed or stressed in his class but I always felt like I was learning. We always opened each class just by talking to each other about our weekends or something in french instead of just diving in. He's a pretty generous grader ( I think he once kinda apologized for giving me a B+ on a paper which I was totally deserving of). He prepares you well for his quizzes and midterms; there were never any surprises. It's all grammar based so no memorization of vocab. You go over all the homework together but none of it's ever picked up or graded. That's not to say you shouldn't do it thoughâ€“if he calls on you to answer one of the hw questions he'll notice if you have it done or not which helps/hurts your participation. \nThis review is kinda all over the place but I just want people to know how great Sam Bloom is. Fairly easy and super fun class.\n\n          Workload:\n        4 quizzes\n3 papers (ours were all based off of the writing prompts on the quizzes so they were basically re-writes)\nmidterm & final\nA couple of exercises out of the book for normal class days (based on completion)","Date":"September 18, 2014"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c91" },"Professor":"Sam Bloom","Course_ID":"FREN BC1102","Course_Name":"Review of French Fundamentals","Review":"I seriously don't understand why this man doesn't have a gold nugget! He is one of the most understanding and comforting teachers at Barnard and he really helps to make sure that every student in his class understands the material. He never assigns too much work that is overwhelming and will go out of his way to help students understand whatever is confusing them. He's a very generous grader and prepares you incredibly well for the tests. The homework is never collected, but you should do it anyways since you'll go over it in class and look a little silly if you don't know the answer. His classroom is very very relaxed and he immediately puts the class at ease. \n\n          Workload:\n        3 compositions with corrections, quizzes every other week (corrections were allowed), homework (not a lot at all, maybe 45 minutes worth) between each class, and a midterm and final.","Date":"April 05, 2015"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c92" },"Professor":"Sam Bloom","Course_ID":"FREN BC1203","Course_Name":"Intermediate French I","Review":"Professor Bloom is the best French professor I've had at Barnard. So caring, funny, and understanding. Quizzes, Midterm, and Final are extremely fair. Professor Bloom also emphasizes having a French class with a relaxed atmosphere  - i.e. he will never call on you randomly to immediately conjugate a verb. This makes the class beyond enjoyable and students can learn at pace where they can understand the material without being stressed about immediate regurgitation! I feel that my French grammar skills have improved immensely because I was able to take the time to learn the material in environment without the anxiety-inducing strategies employed by most French professors I have encountered at Columbia. \n\nTake this class!\n\n          Workload:\n        3 compositions, easy weekly assignments, 4 quizzes, in class midterm and final.","Date":"May 15, 2013"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c93" },"Professor":"Christoph Schaub","Course_ID":"HUMA C1001","Course_Name":"Masterpieces of Western Literature and Philosophy (Literature Humanities)","Review":"I didn't see any reviews for Schaub in terms of his Lit Hum class, so I thought I would try to help people out with this. Schaub is a very good Lit Hum instructor- he makes the class mostly discussion-focused, but stopped us occasionally to make his own comments or to shoot down a point if it got too ridiculous. The class was run without quizzing, study guides, or any of the other painful extra work that some other Lit Hum sections integrate: it's all discussion, some of which is lively and interesting, and some of which is just tossed in for the participation grade. \n\nIn terms of papers and exams, Schaub is a fairly generous grader. He informed us that he didn't give any grades below a B on our first paper, at the very least, and that he defined an A as a \"very good\" paper- I got an A on both my papers despite turning in a lightly revised first draft for my second one. He provides great feedback on all exams and papers we got back, which is insightful without being harsh. \n\nIf I had one complaint to make, it's that I didn't find any of the class especially mind-blowing. I thought Schaub's comments on the texts were interesting and insightful, but there wasn't anything to make me reconsider how I read literature or existence itself or anything- it was just an enjoyable class with an instructor who had good things to say. If there was a model for a standard and well-executed Lit Hum section, I think this would be it- no deviations from the syllabus whatsoever, good (but not great) discussion, and a well-organized and fair instructor who was available for help and very responsive to requests for it. More or less, I'm trying to say that you should consider yourself quite lucky if you've ended up in Schaub's section, but I'd tell you not to expect the Core section that Columbia sells in its admissions process (though I really have my doubts as to whether or not that ideal section- 22 students with insightful things to say and a brilliant professor to guide them- actually exists or not). \n\n          Workload:\n        Standard for a Lit Hum section, lighter than some others I've heard of- two papers, one 5-6 pages, the second 7-8. Midterm and final. Readings are standard, with no additions to the syllabus.","Date":"December 18, 2016"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c94" },"Professor":"Marcel Agueros","Course_ID":"ASTR 1753","Course_Name":"Introduction to Astronomy I","Review":"DO NOT TAKE THIS MAN!!! The comments below are wayy too forgiving. The avg. grade in this class was a 60. Yes he curved, but he was not specific on how he was going to curve, so he kept you wondering throughout the semester. As one student put it, he's like a TA gone wild! His exams, quizzes and homework assignments are ALL written in abstract form and they are ALL trick questions. Some of the questions didn't even have the right answer as an option. My GPA is a 3.9. I am not a lazy student looking to rip on some professor because he gave me a bad grade. This guy is just impossible and will give you an unbearable workload that will stress you out BIG TIME! He is a Harvard graduate and he definitely lets you know it! He comes off all cool and easygoing and then 1/2 way through the semester he has you crying. Don't fall for it. Stay away. Take Bio or something. This astronomy course is not easy, fun, or fulfilling.  \n\n          Workload:\n        Heavy.","Date":"December 22, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c95" },"Professor":"Nataliya Galifianakis","Course_ID":"BIOL W3006","Course_Name":"General Physiology","Review":"Really a great and sweet woman. Extremely knowleadgable about her material - you'll ask her a question and she will go like, super in depth  to a level you'd be surprised, given the breadth of what she teaches. Exams are super straightforward. THIS CLASS IS A MUCH BETTER PREPARATION FOR THE MCAT THAN MOSHOWITZ. In fact, intro to bio with moshowitz is almost a complete waste of time. Don't be frightened by mosho because of rumors that she 'writes questions for the mcat.' You want to take physio if you're taking the mcat - it covers pulmonary, cardiac, kidneys, digestive etc - all the areas that are heavily tested on the mcats, and in a level of detail commensurate with that exam. \n\n          Workload:\n        Quizzes at the beginning of every class. basically just read last weeks lecture slides right before class and you're guaranteed a 4/5 at least. AND THEN she also lets you get the extra quiz point on the exam if you need them. 3 exams and a final, all pretty straightforward not too hard. Again, just read the lecture notes - she teaches to her test which is great. Her notes were more helpful than the textbook IMO. She's also great to talk to and very sweet.","Date":"May 02, 2014"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c96" },"Professor":"Nataliya Galifianakis","Course_ID":"BIOL W3006","Course_Name":"General Physiology","Review":"This class is informative and extremely relevant for the MCAT.  Dr. G is a decent professor--she tries her hardest and is a very lenient and quick grader. She also works at NYU med, so she knows what she is talking about.  I don't it is hard to understand what she is saying 98% of the time, but sometimes she gets confused or doesn't explain things clearly.  Luckily, 90% of the in class notes come from the textbook, so you can always double check your notes with hers.  At the start of every class there is an inclass quiz--sometimes with ridiculous questions, but overall the quiz grade is 5% total (or 1.66% of the grade per unit) and you can earn up to 80% of the quiz grade for that unit on the exam.  As a result, during the first test, I went to class and paid attention, for the second test I paid half attention, and for the third test I would take the quizzes and leave, teaching myself the material from the textbook.  My exam grades did go down little by little, but I earned an A in the class so it is feasible to teach yourself the material.  Overall, physiology was an interesting, stressfree course that I think has provided me a good basis for medical school physiology next year.\n\n          Workload:\n        3 tests, daily quizzes, a couple straight forward article assignments/ 'research assignments' that I wrote a page and a half for and got full credit each time.","Date":"June 01, 2013"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c97" },"Professor":"Nataliya Galifianakis","Course_ID":"BIOL W3006","Course_Name":"General Physiology","Review":"Nataliya isn't the greatest teacher, and saying that is a huge stretch, but considering how Tong for Biochemistry was unintelligible, she's better than him at least.\n\nNataliya has a Russian accent and is a Neuroscience researcher at NYU (her office is at NYU) but she got a PhD in Russia for Physiology I think, so that's why they hired her for this job. Personality wise, she's adorable and makes these \"non-funny\" jokes but it's hilarious cause of the way she says it in her accent....that said, she sometimes says stuff that doesn't make sense/her exam questions and quiz questions don't make sense because of the bad english. That said, she could definitely do well in Lit Hum/CC lol, if she were a columbia student, so her english isn't terrible.\n\nNataliya has powerpoint slides and she lectures basically nonstop and gives you a ton of information - she has a page of notes that she refers to when she herself is confused. I've seen it - it's packed with size 6 hand writing. Sometimes when people ask questions and she doesn't know the answer, she takes like 2-3 minutes reading her notes and then sometimes if she still does'nt know it, she BSes you with a weird ass answer and people accept it so she'll move on lol.\n\nTHe information she gives is 97% from the book, so really attending lecture is not necessary. On the 3rd to last day of class ,Nataliya didn't give us our daily quiz (i'll talk about that later) and she said at the beginning \"Okay, so no quiz today so you can leave\" and she didn't mean it as a joke. I counted that day, and out of 87 registered students, there was only 47, so only about half of the class shows up for lecture. \n\nThat said, her lectures HELP. They definitely do. They reinforce the material and what she tests on is completely from her lectures, like 100%, and the book gives you unneessary and too detailed information a lot of the times. However, like like I said, Nataliya speaks super fast and gives you so much info it's impossible to take it all down, so it's inevitable you'll miss information, which is why the book is necessary. I took notes on my laptop, powerpoint, and basically just typed super fast and copied word for word what she said. I think about half of the people who attended class did the same. \n\nOkay, so Nataliaya gives you daily quizzes (a drag), which is 5 multiple choice questions. You have about 8 quizzes per exam (so 8 lectures every exam) and each quiz is 5 points, so 40 points total. On her exams, there's an optional \"make up quiz\" section, which is 6 multiple choice questoins weighted 4 quiz points each, so you can make up like 80% of the quiz points. Also, the total quiz points per test is 35, so you already have 5 extra points from the 8 quizzes (7 x 5 = 35, 8 x 5 = 40). Her quiz makeup questions, however, are kinda harder than her daily quizzes....i usually got like 3-4/6...so I would advise people to attend class and take the quiz at the beginning for all quizzes, instead of being like \"i'll take 3 quizzes then do the quiz makeup\"....\n\nQuizzes and her online labs are 10% of your grade, so they do make a slight difference, since majority of people get near 100% in that, whiles some people only get like 95% of that....so that's like a 1% overall grade difference, which helps if you're in B+/A- range. \n\nHer online labs are PhysioEx 9.0 Lab exercises (you have to buy a manual). You do online \"labs\" which just involves following the lab manual instructions and then recording data and answering questions in your lab sheet...you take the quiz on courseworks which randomly generates 10 questions. The quetsions are exactly the same as on your lab review sheet, so that's why you have to do the lab to fill it in.\n\nHowever, lots of answers for the physio lab are online, or general answers you can find through wikipedia (ie: what does pepsin do), while others you might actually have to do some sections of the lab cause it's like \"which test tube (1-8) indicated signs of hyperglycemia\" and crap...\n\nSo Nataliay gives 3 Exams (no final), so the 3rd exam is the last day of class. Her exams usually composed of \"low weight\" MC section, \"high weight\" MC section, and short answers. \n\nHer low weight and high weight MC are just MC, but the low weight questions are 2 points each and high weight are 5 points each. Her short answers give you half a page of writing, but she stresses each time she only wants 3 sentences MAX and sometimes one sentence is enough. Of course, I've seen those obnoxious people who always ask questions and crap writing in size 10 font, filling up the whole space lol. Her MC usually total 40 points and short answer is 60 points.\n\nNow the high weight MC is annoying because each question is 5 points and thsoe high weight quetsions are usually harder than the low weight and the short answer. They're not \"hard hard\" but do require some thinking for usually 2 of the questions out of the 5-6 total high weight. THe curve on the tests is usually 2 points, so really if you miss 2 high weight MC (cause you probably didn't get 100% on the rest of the test), you get a B on the test. A super smart friend of mine is probably getting a B+ in physio cause of the high weight MC crap area. He got solid A's in orgo and A-/B+ in Moshowitz, come on! \n\nNow her tests are pure memorization, like just pure memorization, but there's a lot of stuff. For the first two exams, purely memorization from the book and I got 95 and 93 on them....for the 3rd exam, which we took 2 days ago, it was only 90% from teh book. She actually tested us on stuff not in teh book taht she talked about in class, like lactose operon system/physiological effect, injury response rate with insulin effect, Rhesus blood factors, breakdown of certain sugars (lactose = glucose/fructose),specialized GLUT receptors for skeletal muscles, etc......so the 3rd exam was probably a lot harder than the first two. Also, the third exam had no high weight MC questions which was a good relief!\n\nOh, also, for each exam unit except for the last one, she also has questions on scientific papers you read in class. The papers are 1 paper per exam for the first two exams (no paper for hte 3rd exam) and they're usually pretty easy to understand, but she goes over the hard stuff in class at teh end of class, so if you have trouble understanding the paper, attend class the days she goes over the paper. Also, the days she goes over hte paper, no daily quiz.\n\nThe first exam involved 1 MC high weight question on teh paper, while the second exam involved 3 really really short answer questions on the paper, which totaled 15 points, so 5 points each. \n\nIn all honesty, this class doesn't test intelligence, which is why a \"smart\" person can get a B and a \"dumb\" person can get an A, cause it's about pure memorization and not making stupid mistakes or not just making stupid mistakes, but thinking something wrong a little bit on her high weight MC. \n\nHer breakdown of grades, which she has written on the board for each test is basically cuved to this:\n\n38% A\n38% B\n20% C \n04% D\n\nThere's no end curve at the end of class, cause she curves each exam, which ends up being 2 points like I said, although I assume hte final exam will be curved slightly more. Final exam weighted same sa all the other exams, 30% each, with final 10% due to quizzes/physio labs.\n\nI'm probably getting a solid A, unless I bomb the final which I doubt. I don't consider myself particularly smart, but I'm not one of those people who need to stress about getting into a decent med/grad school either. \n\nWhat did I do? I attended all her lectures and took rapid powerpoint notes. I studied those notes exclusively for her daily quizzes and averaged 4-5/5 on each of them. For the exams, I studied 2-3 days in advance, and just read through all the chapters really slowly and took notes on the way. I then reviewd all my powerpoint slide notes, which is a huge amount, devoting 2 hours to it. Remember, I purposefully read slow to absorb the information.Nataliya DOES TEST ON TINY DETAILS, SO MEMORIZE IT ALL. Like what the hell is the importance of knowing lactose breaks down into glucose/galactose vs what sucrose/cellulose/whatever breaks down into? \nI read the paper for 1 hour the day of hte exam (sinec it begins at 5:40 PM) and taht was good enough prep to get 100% on all her scinetific paper related questions.\n\nIn the end though, some luck comes into play cause you can just get unlucky on her 5 point each high weight MC questions and that will screw you over. I missed 1 high weight MC on each of her exams (95, 93 were my grades), so I do think most people will usually miss at least one...so don't go thinking \"I'll study super hard and not miss a single one\" cause that's what i did, but i still missed 1 each time. \n\nSo definitely TAKE this class if your GPA needs help cause of Orgo/Bio. It's not a class that requires intelligence (and i don't mean this in a condescending way), so you know you can compete with the smart people, since it's just memorization, which anyone who got into Columbia should be able to do. \n\n\n\n          Workload:\n        3 exams, no final. each exam is 30% of your overall grade, while daily quizzes and physio lab make up the last 10%","Date":"April 28, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c98" },"Professor":"Nataliya Galifianakis","Course_ID":"BIOL W3006","Course_Name":"General Physiology","Review":"Great class. For all those who hated Mowshowitz, this class will feel wonderful. Excellent text and a super nice prof make the learning experience enjoyable an will add depth to your understanding of the human body. Our TAs were VERY nice, too. The professor is entertaining, funny and accommodating - a nice change of pace for premeds. She doesn't pretend to be teaching you the material in significant detail, which is what I hated about Contemporary Biology (Mowshowitz would teach very little and then ask outlandish questions...as I learn more bio in future courses this will becomes more irritating as I feel I have to \"unlearn\" Mowshowitz misconceptions). But the course actually offers much more detail than cont. bio while reviewing the entire content of that class, minus development. It actually helped me a lot in my research job. It is a great pre-MCAT and pre-med course, that helps to reinforce basic bio with much more depth, and introduce us to the body as a system. You learn to make sense of the various medical tests that a lot of us pre-meds are already working with at our research assistantships - although this part might seem boring if you have no hands-on background, though. The reviews of a couple of research papers in the course add a bit of depth to the content - I would probably recommend adding an additional review of current research in digestion). Unlike the previous reviewer, I found her research background to be very helpful. Sure, she doesn't know every system as well as say the nervous system of the cardiovascular system (i.e. the digestive system module lacks a bit of scientific rigor, and it is a hot research topic right now). This is a basic physiology course, and she is way better than 99 percent of the science profs I have had. Plus she is a researcher at a heavy-hitting med school, so she brings a lot of nuance to her commentary. But there are no real surprises. And the choice of text really makes the course wonderful, since it is extremely well-written. She relies heavily on it so you can actually make use of the exercises in it. Usually profs who try to invent their own way of teaching do not nearly as good a job as one who uses a good text the way it was thoughtfully designed to be used. Do the work and you can succeed, which is how school should be. Her sense of style is awesome, too.  \n\nMy only problem with this course is that it really should be a full year course, and cover the nervous system and reproduction. It would be great if we could do the research paper review for every unit. And bit more emphasis on anatomy would go a long way to helping us be prepared to breeze through this in med school.\n\n          Workload:\n        Moderate","Date":"April 19, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c99" },"Professor":"Thomas Campbell","Course_ID":"HUMA W1121","Course_Name":"Masterpieces of Western Art (Art Humanities)","Review":"Tom was such an awesome, engaging, interesting, and chill professor. I have very little experience with art/art history but Tom made me so interested in what we were learning about, and his class was my favorite course of the semester. He is an extremely fair grader and has a great sense of humor. \n\nThe reviews below literally sound like they are written about a totally different person--Tom is great. I enjoyed his class so much and I'm so glad I didn't listen to the other (completely wrong) reviews he's gotten on CULPA. Take his class!!\n\n          Workload:\n        Midterm, final, a few papers, and standard art hum readings.","Date":"May 22, 2015"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c9a" },"Professor":"Thomas Campbell","Course_ID":"HUMA W1121","Course_Name":"Masterpieces of Western Art (Art Humanities)","Review":"While the review below may seem over dramatic, I have to agree with its overall message. Tom Campbell was indeed a bit of a diva.\n\nAt first I thought I was going to really like the class. It was discussion based and he did a good job of encouraging most people to speak. It seemed really laid back and chill--exactly what I wanted from an Art Hum class.\n\nBut then it took a turn for the worse. Campbell missed probably 6 sessions in the semester. This meant not rushing but skipping many important artists. This almost defeats the purpose of Art Hum altogether, a class that is based on seeing how artists work off each other. Campbell, in a noble attempt to promote discussion, would agree with anything anyone said. Sexual themes in the Renaissance work? Sure! Why not? Disgust for commercialism in Monet? Of course that's valid! I felt as if we were getting away from what the artists actually wanted to convey because of his interest in everyone speaking. Soon people were thinking depictions of David and Goliath were supposed to be charged with sexual connotations. \n\nThen there was the grading. Campbell's feedback on the papers was confusing. I spoke to my classmates to try to decipher what he meant but none of us could see how to improve. After seeing him during office hours, I did exactly what he suggested in my next essay but to no avail. Look. When a student goes into see you during office hours and you give a suggestion and she does it, you are supposed to bump her grade up at least a little bit.\n\nPerhaps most telling, when I went to talk to him about preparing for the midterm he mostly rushed me and seemed like he wanted to get the hell out of there. Finally, frustrated, he told me \"it's just Art Hum okay. You're taking it way too seriously.\" Disinterested, and confusing. A class by Tom Campbell\n\n          Workload:\n        Lots of readings, but nothing terrible. A few essays, an in class midterm and a take home final.","Date":"November 06, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c9b" },"Professor":"James Chamberlain","Course_ID":"HUMA W1121","Course_Name":"Masterpieces of Western Art (Art Humanities)","Review":"James (goes by Colby) was a really nice, young guy and a pretty easy grader, at least in my experience. I submitted the weekly reading responses late multiple times and wrote the final paper without having actually read the articles that I was writing about and still got an A-. It's annoying that he places so much emphasis on the readings, but you don't really need to do them to get an A-, and he does make an effort to explain them before assigning them so they're easier to understand. \nHowever, like one of the reviewers below me, I absolutely hated the way he structured class. He calls on people and asks them to make comments about very specific aspects of the painting, which means that you'll be forced to speak about something that doesn't interest you while you actually might have something interesting to say about some other aspect of the painting, but his need to control the conversation won't allow you to take it into another direction. He also asks questions based on the readings, so things can get a little awkward if he calls on you but you have no idea what he's talking about b/c you didn't do the reading and you're not good at making things up on the spot. As a result, class discussions were incredibly boring (unless you enjoy listening to people nervously spewing BS while trying to guess what a professor wants them to say). \n\nTL;DR: The class is easy enough, but Colby managed to suck all the fun out of Art Hum. Pretty disappointing.\n\nBUT he doesn't actually require you to go to the MET for one of the essays like most Art Hum Profs do! He'll also throw in a joke here or there to try to keep everyone awake, and he doesn't seem to mind if you have to submit something late.\n\n          Workload:\n        Two essays, one about St John's Cathedral and the other about a painting at the MET\nWeekly readings + short reading responses you email to him\nIn class midterm comparing two sets of paintings\nTake home final about the readings","Date":"August 31, 2017"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c9c" },"Professor":"James Chamberlain","Course_ID":"HUMA W1121","Course_Name":"Masterpieces of Western Art (Art Humanities)","Review":"Good teacher, too much work. Change if you get him, unless you want 80+ pages of reading a night, intricately critiqued essays, and a whole lot of weird speech emphasis on the \"ct\" sounds in words and the word \"right?\" after every single sentence. \n\n          Workload:\n        80+ pages of reading a class, paragraph responses due each week, essays, calls you out in class regularly.","Date":"October 26, 2016"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c9d" },"Professor":"James Chamberlain","Course_ID":"HUMA W1121","Course_Name":"Masterpieces of Western Art (Art Humanities)","Review":"Don't take this course.\n\nChamberlain was nice, smart, available when needed, and a good lecturer, although I strongly disliked the way he structured the course and assignments. He placed enormous emphasis on the readings (very dense and difficult to understand articles). Not only do the weekly reading responses add a great deal to the workload of the course as a whole, most of the assignments were based on the readings (midterm included a \"relevant references\" section, essay #2 was entirely based on the readings, final exam was a critique of an article). Most art hum sections don't actually require students to do the reading, and for good reason. I feel like this introductory course for non-art history majors made me detest art history. I would much rather focus on the actual art works than on articles that discuss the artworks. I ended up reading more for this class than for Lit Hum.\n\nThe vast majority of the class is spent on students answering questions, as Chamberlain calls on everyone once every class. This led to unproductive discussion as, instead of learning what Chamberlain has to say, we spend most of class listening to a scared student trying to bs something.\n\n          Workload:\n        Weekly reading responses\n2 essays (3-4 pages)\n1 take-home final (4-5 pages)","Date":"May 03, 2017"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c9e" },"Professor":"James Chamberlain","Course_ID":"HUMA W1121","Course_Name":"Masterpieces of Western Art (Art Humanities)","Review":"Colby is likely the best teacher I've ever had. His assignments are thoughtful and not labor intensive. I learned more about art history then I ever have before. He is a wealth of knowledge spanning a wide variety of topics - it was such a joy to listen to him. He's incredibly passionate. I feel lucky to have been randomly placed into his class. I highly recommend you seek out this class if you want to come out of it having learned something. \n\n          Workload:\n        3 hours a week: 1-3 readings and a short response a week, but due on the first day of the class so there's no work for the second.","Date":"December 09, 2016"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521c9f" },"Professor":"James Chamberlain","Course_ID":"HUMA W1121","Course_Name":"Masterpieces of Western Art (Art Humanities)","Review":"To disagree with the other review, I highly recommend anyone who has the opportunity to take this class! The readings are not 80 pages as stated below, usually 2 are given a week and if uninterested, you can really only read one (about 20-30 pages each.) Seriously engaging class with someone who is highly informed and passionate about his subject - pretty much any question you have will be answered with incredible insight. The classes are super interesting and, quite often, funny, and the essays are short, few and far between. \n\nDefinitely my favorite class of the semester (and I am a science major!)\n\n\n\n          Workload:\n        Readings and responses (250 words) a week, 1 midterm, 3 essays including the final take home paper.","Date":"December 08, 2016"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521ca0" },"Professor":"Amanda Gannaway","Course_ID":"HUMA W1121","Course_Name":"Masterpieces of Western Art (Art Humanities)","Review":"Amanda Gannaway is AMAZING. I loved her class so much, she really made Art Humanities interesting for everyone. The exams were easy if you paid attention in class and the papers were always manageable. I loved that she incorporated other artists not in the official curriculum when talking about certain art movements so as to include famous women artists and to point out cultural appropriation. (Every single artist we officially study is male.)  I cannot express how much I love her, everyone should take her class. She has inspired me to take other classes that focus on art during my time at Columbia as well. She makes the material both interesting and easy and facilitates student discussion flawlessly. I give her an A+! \n\n          Workload:\n        2 papers, midterm and exam both with take-home essay and in class slide identification. Class participation is important.","Date":"January 09, 2017"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521ca1" },"Professor":"William Gassaway","Course_ID":"HUMA W1121","Course_Name":"Masterpieces of Western Art (Art Humanities)","Review":"William is very nice and knowledgeable about the field of Western Art, however, his essay preferences unfairly disadvantage students new to the field. I found that before coming to Columbia, most of my classmates attended private schools that exposed them to the canon of Western Art, including how to write about art. I did not go to a private school and had never taken an art class before, but then again, there is no prerequisite for the course anyway. This apparently, didn't matter to William, who often thought my vocabulary wasn't diverse enough to merit high grades on my papers. I was never told that my arguments weren't effective or that my papers lacked proper grammar or structure, but was constantly informed that because I didn't use enough \"different words\" that my work was subpar. This stylistic preference seemed to be the sole determining factor between an A and a B. \n\nAlso, I approached William and asked him to explain the concept of symbolism in art to me. I listened to his feedback and even wrote down what he said. I then wrote my essays on the midterm according to this information, and still received a subpar grade. \n\nBecause of these experiences, I feel William's class privileges those students fortunate enough to attend a private school before coming to Columbia, and leaves the rest of us out in the rain.   \n\n          Workload:\n        In Class Midterm, Final Project","Date":"November 11, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521ca2" },"Professor":"Alexander Rothe","Course_ID":"HUMA W1123","Course_Name":"Masterpieces of Western Music (Music Humanities)","Review":"Like most, I was fulfilling a requirement, and I did not expect how fun and educational the class would be because of Professor Rothe's excellent teaching. He consistently was very prepared and did a great job of discussing pieces as how they were representative (or not) of a broader historical time period. He would actively encourage us to return to the key concepts and descriptors we learned in the beginning and use them as tools to analyze the music, which I felt was helpful for reinforcing them. \n\nIt is clear how passionate he is about the subject when he discusses experiences like his visit to Notre-Dame or shares his favorite musicians and their work. He also had a fun sense of humor that made class more enjoyable. If you have a chance, Music Hum with Professor Rothe is a great experiences. \n\n\n\n          Workload:\n        Readings, quizzes, concert papers, midterm, final, attendance- manageable, reasonable workload for Music Hum/Core standards.","Date":"January 17, 2017"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521ca3" },"Professor":"Alexander Rothe","Course_ID":"HUMA W1123","Course_Name":"Masterpieces of Western Music (Music Humanities)","Review":"Professor Rothe is great. I would completely recommend him. He's very knowledgeable and passionate (he often asks 'have you heard of xx's films/songs/art?' and it was kind of endearing how he would also look a little crestfallen if no one raised their hands but delighted when someone did). I didn't have a strong music background and my class was a mix. But he managed it well by being very patient and also using the knowledge of the experienced musicians. The class was also not very discussion-based, which was fine by me because he had plenty of insights. \n\nI loved the historical focus of the class. Take his class!!\n\n          Workload:\n        Manageable, if you study. MCQs are tricky. Quizzes, midterm, final","Date":"April 14, 2014"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521ca4" },"Professor":"Alexander Rothe","Course_ID":"HUMA W1123","Course_Name":"Masterpieces of Western Music (Music Humanities)","Review":"Rothe isn't as awkward as everyone else says; he's actually wicked funny.\n\nAlso, he's a terrific teacher and I totally recommend you take the class with him. Why? Because you won't have to memorize what 60 very similar-sounding pieces sound like and he's super chill. I've been talking to my other friends who had music hum, and they said they had to do that memorization, and as someone even classically trained in music it seemed a bit ridiculous. Rothe isn't like that. He repeats that he isn't trying to make it unnecessarily hard on you, so our 3 quizzes over the semester are exactly what he tells you they will be like--very historically based, identification between like 6 pieces (which are very different, because some are operas with and without video and like costumes guys come on, some are symphonies, some are clearly only with one instrument, etc.). 6 different works for the midterm, guys.\n\nAll in all, take the class with Rothe. If you look over the material, it's an easy A. Actually do the readings, it's an easy A. It's more historical-based than other music hum sections, as Rothe doesn't see music in a vacuum. He also is into operatic stagings and talks a lot about that, if you're into that.\n\nHE'S THE BEST.\n\n          Workload:\n        short readings for every class. 3 quizzes worth 30% total, two papers worth 15% total, final, midterm, attendance","Date":"November 18, 2013"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521ca5" },"Professor":"Fabio Nironi","Course_ID":"MATH V1201","Course_Name":"Calculus III","Review":"I found Professor Nironi to be very difficult to learn from.  He spend the majority of class time proving the formulas and equations that will be used on his problem sets rather than giving examples of how these tools will be used.  I found this immensely frustrating and aside from the first two weeks of class (which were easier and more clearly taught), I learned 100% from the textbook.  This is no exaggeration.  I would sit through class, pay attention, take notes, and grasp only about five minutes of lecture.\n\nI went to his office hours several times to ask questions and while he was very eager to help, his explanations often continued to go over my head.  I ended up getting most of my help from the Barnard Help room.  (Keep in mind if you decide to do this, only some of the TAs there are familiar with Calc III material so make sure to take note of when they're there.)\n\nProfessor Nironi also offers a voluntary recitation on Fridays.  I couldn't make it due to a conflicting class, so I can't comment.\n\nFurthermore, only one problem set out of nine were returned over the semester, making it very difficult to learn from my mistakes.  He also doesn't believe in posting answers to practice exams, so you won't know which concepts you're getting wrong until you get your midterm back (i.e. too late).\n\nHe writes his midterms to be longer than any student could complete and then grades entirely based on the curve.  This seems intimidating, but actually can work to your advantage because on exams you can entirely avoid one topic that you just couldn't understand and focus more on the things you did understand.\n\nAlso, no Webassign.\n\nOn the whole, I would say that Professor Nironi is a fair professor who is ideal for the student who is absolutely in love with proofs and the more esoteric side of math.  If all you're looking for a solid and clear understanding of Calc III, he's probably not the professor for you.\n\nGrading:\nNine problem sets, worst two dropped. %20\nTwo midterms.  Best one counts for %25, other counts for %15\nOne challenging, but doable final counts for %40\n\n          Workload:\n        One reasonable problem set per week.  Usually took me 4-6 hours, maybe 8 on the hardest ones.  He drops your lowest two.  He also offers extra credit problems which are significantly more difficult.  Challenging, but manageable.","Date":"February 13, 2013"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521ca6" },"Professor":"Fabio Nironi","Course_ID":"MATH V4061","Course_Name":"Intro to Modern Analysis I","Review":"Professor Nironi is fantastic, Most of the reviews that have been posted here are very misleading and are probably written by dumb students. I did both modern analysis 1 and 2 under Prof. Nironi's guidance and thanks to him i acquired a solid understanding of Real analysis. Any course on mathematical analysis is bound to be rigorous, if you cant handle mathematical rigor, this course is a strict NO, if you like math and if you are passionate about learning math, then this is the most basic course that you need to master. I didnt have any prior background in topology/analysis or any other fancy stuff that has been mentioned in other reviews. Prof. Nironi explains the concepts very well and his notes is excellent. Infact i prefer his notes to the prescribed text(Rudin) just because its more accessible than Rudin for a novice. He is very helpful(There were instances when he went over the entire proof when i had trouble understanding the proof)and his grading too is fair. I do agree that he gives difficult(but thought provoking)mid term exams sometimes and he does it deliberately to gauge the level of the class. He adjusts the difficulty accordingly in subsequent examinations. Over all it was an enjoyable experience learning analysis 1 and 2 from Prof. Nironi. \nP.S. If you cant understand what Prof. Nironi is teaching then you are simply not good enough for studying real analysis , drop the course otherwise you will inevitably screw up and post another misleading review here !\n\n          Workload:\n        1 homework a week","Date":"January 11, 2013"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521ca7" },"Professor":"Fabio Nironi","Course_ID":"MATH W4061","Course_Name":"Introduction to Modern Analysis","Review":"I agree with the previous post. To sum it up, I think Nironi's teaching style punishes, rather than encourages, students who are learning the subject for the first time; for example, from personal experience, he doesn't give much partial credit on exams, if it all.\n\nFinally, at the last second (way after finals), he decides to completely disregard the homework portion of the grade (20% of the final grade), saying that most students copied from online sources (which I assume is b/c while most students did relatively well on the homeworks, only a handful did well on the exams). I don't agree with this in three aspects: 1) homework problems are much easier than the ones on the exams b/c they're open book and there's no time constraint 2) even if students did find solutions online, it's not that much different than looking up solutions in the student manuals, which is available for many math classes 3) while some may have cheated, some may have actually gotten help from other students or tutors. To drop 20% of the final grade and make the final exam worth 50% after the exam had already been taken, I think it's unfair.\n\nNironi is a likable professor but his teaching style discourages students who are learning the subject for the first time. The material as difficult as it is, on top of that, with no homework grade and no partial credits on exams and an exam format that favors students who have a strong background in the subject (exams are structured in a way that there are more questions than you have time to answer, which naturally favors students that are familiar with the subject from the start), his teaching method is extremely unforgiving for newcomers. I'd recommend taking this class with some other professor.\n\n          Workload:\n        final workload completely different from the original one in the syllabus (not sure if he's allowed to change it?) but it's 50% final, 20% 2 mid terms (25% best 15% worst)","Date":"December 30, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521ca8" },"Professor":"Fabio Nironi","Course_ID":"MATH W4061","Course_Name":"Introduction to Modern Analysis","Review":"I agree with both of the previous reviews. Fabio Nironi has no idea how to teach a class.  After observing other analysis classes, there is a clear difference between the teaching those professors gave and that of Nironi. They helped, he recited.  De Silva was amazing, Nironi was terrible.  Take it with her or whoever else.  The last review talked about how Nironi made the midterms 20% and 30% and the final 50%, and I agree it's unjust.  Yeah maybe people cheated, but that's the real world and Nironi, after all that schooling, should learn to deal with it.  That's why the homework is only 20%, if people didn't cheat the homework would be 100% rather than putting 80% of the grade on random sit-ins prone to error.  \n\nThat's not to say cheating is a good thing. I'm sure the class would have loved to have done the problem sets, but you see other professors assign 4-5, maybe 6 problems a week from Rudin. And those problem sets take forever.  Nironi assigns 10, and they're mostly the most obnoxious problems Rudin provides.  The class almost felt like this guys revenge on people who didn't appreciate math like he did.  I mean the proof of Rolle's theorem, probably one of the easiest questions on the exam, still takes a fair amount of ingenuity to pull out of thin air.  He has no idea how to write a test because the problems he assigns for homework can take 3 hours to hammer out in your head, and the questions on the exam were harder than those on the homework. \n\nIt's not like he went out of his way to help anyone. He didn't host review sessions, answer questions well, post any notes after like the second week, collect the problem sets (we had to drop them in his drop box on our own time), or even tell us when he assigned homework or when it was due.  His method was simple,  Assign the first three questions from the last chapter and the last 7 (very annoying ones) from the previous chapter.  He did squat for this class.  Office hours were pointless or absent, and you'd never see your problem sets even if you attended because he tended to lose them in his train wreck of an office.  The only point where I disagree with the previous reviews is where they claim he cares or is even a good person.  He's lazy (he desperately ran through half the material when he realized he was far behind) but he wants to be brutal out of some misguided idea this will make us all love and be better at math.  His worthless presentations and claims of A+'s are just excuses for his apathy. I'm dead serious, stay away. No matter how well you'd do with him, you'd do better with someone else teaching.\n\n          Workload:\n        An unreasonable amount:  9 homeworks of 10 problems each. some required topology textbooks, others were just painfully long.  One was 11 pages for me.  The exams literally require that you've seen and remembered the proofs elsewhere, they don't test your knowledge of a process taught by him but of a process either taught in topology or something completely unrelated to analysis (what was his stuff on commutative maps?) or your memory of a proof from some topology book or a half a page long proof in rudin.","Date":"January 03, 2013"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521ca9" },"Professor":"Fabio Nironi","Course_ID":"MATH W4061","Course_Name":"Introduction to Modern Analysis","Review":"Unfortunately previous reviews for Nironi also hold in proof-based classes. I'd like to say he's very dedicated to the subject and looks to share that inspiration, but I feel there are some problems with that.  First of all he quit posting homework solutions after the fourth problem set, and when people requested more solutions he emailed the class and told us to Google them.  In fact, he didn't even hand back our homework, you had to be lucky enough to find him in his office.  \n\nSecond  his office hours were a real pain, immediately after the class at a time where almost anyone would have another class to attend, and he wasn't particularly personable when he was available. of all he pretty much just lectures straight from the textbook, it even sounds as if he's reading to you.  Some people find it a virtue when a professor follows the textbook closely, but that wasn't really the case.  Rudin's exposition is so much better than most people didn't really take any notes or pay much attention at all to his lectures, which are particularly hard to follow anyways.   \n\nThird, he mostly, with some notable exceptions, just lectures straight from the textbook, it even sounds as if he's reading to you.  Some people find it a virtue when a professor follows the textbook closely, but that wasn't really the case.  Rudin's exposition is so much better than most people didn't really take any notes or pay much attention at all to his lectures, which are particularly hard to follow anyways.  As for those exceptions, he adds in a ton of topology, far past what Rudin found necessary.  Some of the definitions in Rudin are esoteric but that's because they make the material more fluid.\n\nFinally, while on the note of topology, quite frankly if you haven't taken topology and algebra don't take analysis with Nironi.  He really presumes you know a lot of mathematics beforehand even if he claims this is where everyone should start in college.  I was in topology for about half the semester and I could clearly see that the handful of us had a clear advantage over those who didn't know what all his additional topology was going on about.  This was particularly obnoxious on the first midterm and to some extent the second midterm where half the material was literally topology, which is fine only as far as the second chapter is concerned, not when he expects you to pull the product/box/discrete topology out of some spark of innovation and work with it.\n\nOther notes, his exams were pretty much a free for all, especially the first one wherein he just put a ton of questions without even knowing how many points there were total and told us to run with it. I guess that's fine if you want to do a ton of stuff on an exam, but he wound up curving the average, a 48 or so out of 200 something to a C.  There was a clear distribution based on previous background.   Second midterm was alright, and the final was a pain. \n\nI guess he also realized at the second to- or last week of the semester that he was pretty far behind, so he pretty much crammed differentiation and integration into a week or two and made a problem set due Monday (we were a Tuesday Thursday class) without any announcement (I was particularly unhappy about this since I turned it in unknowingly on Tuesday and have yet to get a grade for it) and then he jammed both the integration and differentiation into a problem set due on study week.  \n\nHe tries to be generous with presentations and extra credit. I did a presentation, its 5 points and given his curves Im not quite sure how valuable that was, if those points are even for tests.   The extra credit assignment I handed in twice and he never noticed I guess, I'd have given it to him at office hours but, you know...\n\nLet's put it this way: If you have a lot of math background, you'll kill in this class.  If not, stay out. Either way, you'll probably enjoy it a lot better with Savin, De Silva, Masdeu, whoever else is teaching, and you'll have a reason to come to class.  I really think he's a nice guy and he probably means well, he just needs to figure out what he's doing.  Maybe disregard this review when it turns brown/green with the \"5 years ago\" statement, he needs to grow has a teacher.\n\n\n          Workload:\n        20% 9 problem sets with breaks given randomly but he says he'll disregard them if you do really well on tests, 2 midterms (25% your better `15% your worse), final 40%.\n\nHe assigns the worst, i,e. 5-part with little benefit in return, problems","Date":"December 25, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521caa" },"Professor":"Fabio Nironi","Course_ID":"MATH V1201","Course_Name":"Calculus III","Review":"His biggest pitfall is that he doesn't take in to account that everyone learns things differently; that each student has a unique way of understanding concepts. \n\nI thought I was just bad at learning calc because I couldn't understand concepts like he did, but I realize that's not the case. I took calc 2 simultaneously  with calc 3, and I did significantly better in calc 2 because that professor took the time and effort to explain concepts in different ways that suited my way of thinking. I'm not saying that my ability to learn solely depends on the teacher's ability to teach - the student also needs to show initiative and willingness to learn (which I do - I'm not throwing $60,000 a year to not learn). But there's need to be a balance; efforts need to be made on both sides in the right way. Nironi doesn't make that effort, either because he doesn't want to or doesn't know how to. No doubt he's an intelligent man, but not a good teacher.\n\n          Workload:\n        weekly problem sets; 2 midterms; 1 final","Date":"December 19, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521cab" },"Professor":"Fabio Nironi","Course_ID":"MATH V1102","Course_Name":"Calculus II","Review":"So, indeed, prof Nironi is a very smart guy, HOWEVER this is not an excuse for his poor teaching abilities!! \nThe class was incredibly hard. Nironi assumes that all student have previous knowledge in clac 2 and linear algebra and spends all of the class period doing crazy hard profs on the board. \nHe often teach material that is not included in the syllabus or in the book, which he gives handouts for; but good luck with understanding them.\nIt came to a point where the  TA's in the help room didn't knew how to solve his hw, and exams questions.\n\nThe exams are Incredibly hard. The average for the first midterm was about %45 (!) and it did not resembled the practice exam or the hw problems in any way. \n\nBasically, nothing can prepare you for this class, so do yourselves a favor and take it with a different professor.\n\n\n\n          Workload:\n        Weekly problem sets . He drops the lowest two.\n2 midterms and a final. All crazy hard.","Date":"June 29, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521cac" },"Professor":"Fabio Nironi","Course_ID":"MATH V1201","Course_Name":"Calculus III","Review":"I wish I could say something positive about Fabio as a professor, but ..... he is pretty useless for students who IS NOT math geneius. His explanations are way too complicated and very theoretical. You can never solve a homework unless you read a book, get a help from tutors, and have solutions from previous years.\nHis lectures are very demotivational and makes you hate math. Most of the people didn't attend his lectures at all and managed to get a better grades than some of those who attended. \nOn the positive note, he is a friendly guy who is willing to help, BUT his explanations are way too complicated and very theoretical :) So this professor, definitely NOT for people with average knoweledge in math. \n\n          Workload:\n        Weekly HW set: kind of manageable: 15-20 questions every week, BUT do help you to get ready for tests at all.\n2 Midterms: review sessions do not  help at all and just confuse you. Last year tests that he gives as a sample were much easier than an actual tests he gave us.\nFinal:  extremely difficult if you tried to study from professor's explanations.  The only way to pass it is to use every available help for CALC class throughout the semester, and study from the book on your own.","Date":"May 25, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521cad" },"Professor":"Fabio Nironi","Course_ID":"MATH V1102","Course_Name":"Calculus II","Review":"Professor Nironi, or Fabio as we affectionately call him, is incredibly dedicated to teaching in the most basic sense: his goal is to make you learn math, not to make it easy or fun.  I took Calc II and Calc III with him.  He will put in many extra hours to help his students; he holds an optional recitation to do homework problems and frequently meets with students in his office.  That said, while he works extra hours, so will you.  My classmates and I spent a great deal more time working for his class than our friends in other sections.  I really recommend finding a study group within his class, that was super helpful for me.  \n\nDo not take Fabio's class if you are easily frustrated, entirely uninterested in math, or just want an easy A.  I felt that grading was very fair, but the averages were brutally low, so much so that your raw score was basically meaningless.  I got an A both semesters, but I worked really hard and enjoyed a lot of the math.  \n\nAs a person, Fabio is a wonderful, kind, eccentric, brilliant-professor type.  I sincerely appreciated how he would be knitting an enormous fuzzy sweater during our midterms and some of his better comebacks when people asked annoying questions.  He also never intentionally made me feel stupid (and I asked a fair amount of questions).  He would never think of sending a student to a TA without helping him/her first.  He didn't even trust the TA's (with good reason) to grade our finals.  \n\nI'm really glad that I took Fabio's class, but it certainly wasn't easy.  Best of luck!\n\n          Workload:\n        A problem set (usually pretty long) every week.  Two very hard midterms, but with a fair curve.  An extremely hard final (usually with averages below 50%), but a fair curve.  Harder than most Calc II or Calc III classes, but not unmanageable.","Date":"July 08, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521cae" },"Professor":"Fabio Nironi","Course_ID":"MATH V1102","Course_Name":"Calculus II","Review":"This class was hell, to put it simply. He spends class periods going through long and complicated proofs, which he can't clearly explain and which he doesn't often completely finish. \n\nHe knows the knows the subject a little too well - he'll give explanations that skip several steps, which would be fine if we weren't trying to learn the information for the first time. He will backtrack and explain if you ask him to, but often his explanations become more convoluted with time. And because he's so familiar with the subject, he has his own method of solving problems that don't correlate at all with the textbook and don't make sense to a lot of students.\n\nHomework isn't bad, provided you go through the textbooks explanations and use the math help room for any questions you have. However, once homework starts including his practice tests, your kind of screwed. I've taken the test to the help room and had TA's be completely stumped, and asking me if I was sure it was for Calc II and not a higher class. Unfortunately, these practice tests are a good reflection of what the midterms and final look like, meaning not good.\n\nReview sessions before the test - eh, go if you want to. It probably won't actually help, but feel free. I went to all of them, and each felt like a waste of time.\n\n          Workload:\n        HW is pretty manageable. About what you'd expect.\nTwo midterms, the first of which isn't bad at all if you learned the info in high school, the second is considerably worse. He actually offered extra credit, the scores were that bad.\nOne final that is absolutely, depressingly impossible.","Date":"January 17, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521caf" },"Professor":"Fabio Nironi","Course_ID":"MATH V1201","Course_Name":"Calculus III","Review":"Take this class if you are an aspiring mathematician (or masochist). Otherwise, there is really no reason to put yourself through this. Fabio is really easy-going and niceâ€”he wears sweats and a power rangers shirt pretty much every classâ€”but his explanations in class tend to be unnecessarily complicated and abstract. I found that I was better off learning from the book, except he likes to diverge from the book sometimes. For instance, he taught us second order Lagrange, which was not in the book at all. But the real trouble with this class is the exams. For the most part, the problems on the exams are nothing like any of the problems from the book. Preparing for his exams felt pretty hopeless for that reason. \n\n          Workload:\n        weekly problem sets","Date":"May 15, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521cb0" },"Professor":"Fabio Nironi","Course_ID":"MATH V1201","Course_Name":"Calculus III","Review":"I thought I wanted to be a math major...until I took Nironi's class. He is a very smart guy and approachable, but he doesn't understand how to communicate with students, particularly students learning a subject for the first time. I went to his office hours for the first half of the semester, but I always walked out even more confused. Recitations weren't that helpful either. homeworks are useless for studying for exams (he said that himself). exams aren't meant to be finished (he said that too). he doesn't give solutions to past exams, so I struggled a lot when I tried practicing on my own and with classmates too.\n\nOther students may say that Nironi actually makes you learn real math rather than regurgitate theorems and formulas. But I disagree. I felt that Nironi could have done a better job of laying down the basics before throwing us into the deep end. I've never felt so discouraged about a class before. \n\nPlease take this as a fair warning - if you want to keep your sanity and have a decent GPA, don't take Nironi's classes (at least the basic level ones). \n\n          Workload:\n        weekly problem sets; 2 midterms; 1 final","Date":"December 19, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521cb1" },"Professor":"Peter Horn","Course_ID":"MATH V1201","Course_Name":"Calculus III","Review":"Professor Horn is mediocre as a lecturer and extremely apathetic as a teacher. The reason why he earns a silver nugget is maybe because that the mathematics department lacks professors who are American to teach 1000 level class. As a result, he stands out among all the foreign professors who are either not very proficient in oral English or unfamiliar with American classroom culture. Having those reasons in mind, it is not hard to understand why he becomes the one to go for. It is nonetheless the tragedy of Columbia undergraduate mathematics department. But essentially, he is not any more sophisticated in terms of actual teaching and even less passionate about the class than a lot of other professors. He goes by a credibly rigid style which follows exactly the textbook and even uses the exact examples on the textbook. This is very unsatisfactory if you actually like mathematics. By the way, a lot of times, you will find textbook is written with more nuances and passion than he is. You can safely escape almost of the lectures, but still do perfectly fine for homework and exams. Of course, it could be a good thing depends on your purpose of taking calculus. He would give practice exams before exams, but those are all by other professors and he will reject to offer solutions because they are not by him. Excellent logic, huh?\n\nHowever, what really motivated me to write a review about him is an accident which really made me indignant. His homework component of the grade consists of 12 problem sets, each is 2.5% of the final grade. And he lost my last homework. I wrote to him, to ask if I can make up for it. He replied with a condescending and vague answer - \"I wouldn't worry about it.\" I found it very rude. So I wrote to the chair of the department, and he finally gave me an explanation of his rules which go along the line that exceptions cannot be made in order to sustain the fairness of the majority. On the other hand, he neglected the fact that this could well be his or his TA's responsibility. The homework policy for almost other if not all Calc classes is that the worst problem set will not count. I smashed the final exam in the end. It is not so much about the tiny argument of grade, but is about how college demonstrates a real world by presenting to you all kinds of people. As a class taken at the very beginning of college, it might as well a critical time to re-calibrate your expectation of teachers as teaching in college to the instructors may come as first, second or even less significant. \n\n          Workload:\n        comparatively long but not hard 12 problem sets from the textbook (all count, 30%) ; 2 midterms (20% each); final (30%); class average is around 65% for the exams.","Date":"January 21, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521cb2" },"Professor":"Peter Horn","Course_ID":"MATH V1201","Course_Name":"Calculus III","Review":"Here's the thing:  Dr. Horn is fine as a teacher, but nothing more.  Like the reviewers have said below, he explains the concepts fine, his homework is fine, and tests are fine.  But I guess with a silver nugget, I expected more from him.\n\nI went to all the lectures (probably because it was an afternoon class, so I couldn't justify sleeping through it to myself), and am not sure I learned anything in the class that I couldn't from the book alone.  His lecture and assignment material follow so closely to the book that he seems completely unable to justify anything beyond the cursory explanations they have in the textbook (Whenever a question starts with \"Why...\" he'll stumble over his words for 30 seconds and inevitably end up saying \"Well, that's just the way it is.\")  The nice thing about this religious devotion to the book is that if you can do the weekly homework problems, midterms and the final are pretty easy, except for a few more thought-requiring questions.\n\nAs someone who really likes math, but is a science major, I decided to go the Calc III-IV route instead of Honors Math, and I'm not sure whether that was the best idea or not.  The thing that makes me saddest about this class is there was nothing about it that made me interested in the subject at all.  All through single-variable calculus, there were tons of little moments where the coolness (some more brave people would say \"beauty\") of the subject really came through.  Those moments just don't show up when all you do is teach the book.\n\n          Workload:\n        Not bad.  Weekly homework sets come right from the book, and they never took too long.  The graders choose a few problems to actually grade, so if you don't understand a problem or two it won't hurt you too much, and those might not count at all.  2 midterms a final are all pretty much the same format, with mostly non-tricky problems and one or two thinkers.","Date":"January 15, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521cb3" },"Professor":"Peter Horn","Course_ID":"MATH V1102","Course_Name":"Calculus II","Review":"no matter how good he is able to articulate concepts. Peter Horn is surely NOT a good instructor. Truly good instructors really inspire you to explore more on your own and inspire your love in the subject.  But Peter Horn does the complete OPPOSITE. he makes you HATE math not because it is hard but because you hate him.\n \nif you look at h ow mixed his reviews are, you will know how he treats his students. For students he doesn't like or isn't familiar with, he is extremely harsh and mean and doesn't even bother to answer your questions. If you don't happen to be the first in every exam, you'd better ingratiate yourself towards him. Otherwise.....\n \nin a word, his good articulation of materials is rendered meaningless by his favoritsm. Take him if you are a zillion percent confident that you can win his favor. And DON'T ever expect him to instill in you a love for the subject. Just focus on the math and try to forget how objectionable he is.\n\n          Workload:\n        x","Date":"January 08, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521cb4" },"Professor":["Joshua Green","Josh Greene"],"Course_ID":"MATH V1101","Course_Name":"Calculus I","Review":"Wow.  Totally assume.  He can draw a figure 8 knot with one hand and trefoil with the other in real time.\n\n\n\n          Workload:\n        Total gut.  Baldwin is better","Date":"September 21, 2016"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521cb5" },"Professor":"Humberto Ballesteros","Course_ID":"HUMA C1001","Course_Name":"Masterpieces of Western Literature and Philosophy (Literature Humanities)","Review":"IF YOU ARE IN HUMBERTO'S CLASS, CONGRATULATIONS!!!! Humberto is such a sweet, brilliant human being, and every class is extremely interesting. He thinks up inventive and fun in-class activities, and he's an extremely generous grader. Don't take advantage of him though, he really wants to make sure that you do well and get something out of his class! I really can't emphasize enough how amazing he is. Truly think he's the best LitHum teacher Columbia has. Will definitely miss him as a professor next year. \n\n\n\n          Workload:\n        2 essays per semester (very interesting prompt options)\nReading Quizzes (not a big deal though)\nVeryyyyy light workload","Date":"April 19, 2017"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521cb6" },"Professor":"Humberto Ballesteros","Course_ID":"HUMA C1001","Course_Name":"Masterpieces of Western Literature and Philosophy (Literature Humanities)","Review":"Awesome LitHum Professor, also a loveable professor who probably has no flaws whatsoever. Gives 1 quiz for each book, except for those that are just pure poetry. During class discussion, does not require anyone to talk although this is at least 5-15% of your grade. Discussions are very insightful and he tries to find creative ways to make the texts interesting. Get use to \"What's going on?\"\n\n          Workload:\n        Generally, 3 essays a semester, may give two. (2 page, then 4 page, then 6 page essay)\nRead the LitHum textbooks although for the Odyssey and the Iliad he spends an additional day on the texts.\nMidterm, which is in the same format as the Final, which is given by the Core offices.","Date":"January 03, 2017"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521cb7" },"Professor":"Humberto Ballesteros","Course_ID":"HUMA C1001","Course_Name":"Masterpieces of Western Literature and Philosophy (Literature Humanities)","Review":"If you have Humberto for Lit-Hum, you just won the lottery.\n\nHumberto is absolutely brilliant. He is a master at instigating meaningful, provocative class discussion, and his insight into the texts is fantastic and life-changing. Generally, class begins with either a reading quiz (which everyone typically fails, but it doesn't really impact your grade) or a passage/scene from the reading. From there class rockets off into scintillating debates on passages Humberto selects for us to close-read. Humberto will oftentimes mix up class agendas; several times he asked each person to prepare a 5 minute speech in the spirit of the Symposium or other, which we would then share with the class. Class time was always spent valuably, and I enjoyed every minute (seriously, every minute) of it this year.\n\nAs if that wasn't enough for you, Humberto is also a genuine, sweet, and lovely human being. One thing I particularly loved is how we would read the texts through a very human lens. It was okay to not understand something, or to voice a strong opinion about one of the characters, or to simply say you loved how a certain scene made you feel. Humberto makes the literature fun and personally engaging, and his kindness and genuine compassion for his students creates a classroom environment that feels like home. \n\nI honestly can't say enough wonderful things about Humberto. If you have him, you will have the best experience ever. \n\n\n          Workload:\n        Well, it's Lit-Hum, but Humberto makes it pretty easy. He is an extremely generous grader (he really wants you to do well!) but don't take advantage of this. Humberto is too good to be treated as somebody who will give you an easy A. He wants to make Lit-Hum enjoyable for you, so do your part!","Date":"May 25, 2016"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521cb8" },"Professor":"Humberto Ballesteros","Course_ID":"HUMA C1001","Course_Name":"Masterpieces of Western Literature and Philosophy (Literature Humanities)","Review":"Greatest professor of my first year. His masterful understanding of works we read was shocking. His passion for the subject was inspiring. He really cares about the students. He is accommodating and wants you to do your best. Recommend to any and all first years.\n\n          Workload:\n        3 essays, midterm, final\n\nEssays are straightforward. Put a good effort and you'll get a good grade. Talking to him before hand outside of class helps\nExams have quote ids which are challenging but fair\n\nAll in all, you should walk away with a solid grade if you put in the effort","Date":"May 20, 2016"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521cb9" },"Professor":"Humberto Ballesteros","Course_ID":"HUMA C1001","Course_Name":"Masterpieces of Western Literature and Philosophy (Literature Humanities)","Review":"Best professor I've had all year. His passion for the literature in the LitHum syllabus really contributes to the overall atmosphere in the class. The guy is brilliant- knows 5 or 6 languages--including Spanish, Italian, French, and German--which is helpful when discussing translated literature. I learned so much and looked forward to going to class.\n\nOverall, he's just a really nice guy. He is very open to new suggestions and ideas and expresses his honest opinion, sometimes providing good constructive criticism. He has given extensions for papers to the whole class and dropped quizzes on which we all did poorly. Great sense of humor as well. \n\nI would recommend him to anyone trying to switch \n\np.s.- we discussed Game of Thrones for our last class of the year \n\n          Workload:\n        1 quote quiz per book- 10 points each (~10%) \n3 or 4 papers per semester \n1 Midterm \n1 Final \n\n-not too bad overall","Date":"April 28, 2014"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521cba" },"Professor":"Humberto Ballesteros","Course_ID":"HUMA C1001","Course_Name":"Masterpieces of Western Literature and Philosophy (Literature Humanities)","Review":"Humberto is easily the best professor I've had at Columbia thus far. And it's not even close. \n\nRight off the bat, he is the most humble, down-to-earth (to the point of hilarious self-depreciation sometimes), and genuine professor I've known. He has not illusions of grandeurâ€“â€“he sees himself as just another member of the class, one who incidentally gets to grade the papers and offer feedback.\n\nHe loves these books, and he shows it. Every once in a while, towards the end of class, he'll just start waxing poetic about the meaning of life and how a particular book, passage, or idea helped him think about this. One of these speeches resulted in a full-blown standing ovationâ€“â€“he's that good. \n\nHe's an easy grader, mostly because he doesn't care about the grades. And if you meet with him before handing in a paper, he will offer concrete advice on how to improve (read: get a better grade on) your paper.\n\nIf you landed Humberto, consider yourself lucky. He's not just a great professor; he's just a damn good guy to be around and to learn from.\n\n          Workload:\n        standard lithum coursework. 3 papers. midterm. final. weekly quiz (which i don't think really matters)","Date":"May 16, 2014"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521cbb" },"Professor":"Humberto Ballesteros","Course_ID":"HUMA C1001","Course_Name":"Masterpieces of Western Literature and Philosophy (Literature Humanities)","Review":"I miss Humberto now that I am taking CC with somebody that is not Humberto. What I mean to say is that I didn't truly realize how good of a deal I had until I was faced with the reality of taking a class with a vaguely clinical, stilted professor. As others have said, Humberto is really one of the nicest, best people you could take Lit Hum with.\nThat being said, you run the risk of missing out on some incredible insights if you can't maintain your own focus because the classroom he runs is not under draconian rule and you won't be forced to participate. If you don't pay attention, its not like your grade's going to die. Its more like the palpable disappointment will rip your heart right out of your chest. \n\n          Workload:\n        Standard. \n1 quiz per work (this may get dropped if the whole class performs poorly)\n3 essays of neither great difficulty nor length\nmidterm and final","Date":"September 15, 2014"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521cbc" },"Professor":"Marilyn McCoy","Course_ID":"HUMA W1123","Course_Name":"Masterpieces of Western Music (Music Humanities)","Review":"What to say about Marilyn McCoy. SHE IS AMAZING! Now granted, after talking to other students in different sections of Music Hum, I realized that I had to do a little bit more work than others in the different sections, but in the end, it was worth it. She has such a passion for the material, and is such a great teacher! She truly cares about her students, and does everything she can to see each of us succeed. Her lectures are informative as well as fun, and does a really good job describing musical terms and jargon, so people without music backgrounds can follow. I would seek her out for this class, and I learned a lot having her. Her class was my favorite last semester, and if I ever take another music class, I want it to be with her.\n\n          Workload:\n        A little bit more than most Music Hum sections:3 Tests (8 Sections/5 Questions each listening, 20 non-listening questions) Short (2-3 page) Papers, class blog assignments, and a Concert/Opera Review. With the Tests, she goes over certain pieces in great detail, but if you pay attention during lecture and actually listen to the music with the listening chart, you will do just fine on the tests. All the readings are through course readers through the Village Copier, and that contains all the information you need. She is a pretty generous grader so just put some effort in and you will do just fine.","Date":"February 16, 2013"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521cbd" },"Professor":"Marilyn McCoy","Course_ID":"HUMA W1123","Course_Name":"Masterpieces of Western Music (Music Humanities)","Review":"Prof McCoy was awesome.  I'll agree that there are a TON of assignments, but none of them take long, and she's not a tough grader at all and gives extensions to anyone who asks.\n\nAs earlier reviews note, she covers the material in a pretty different way than other teachers.  Her course is based on First Nights, a book that covers only 5 musical works (Monteverdi's Orpheo, Handel's Messiah, Beethoven's 9th, Berlioz's Symphony Fantastique, and Stravinsky's Rite of Spring).  Regardless of whether you like the works, you'll learn a ton from them because you spend so long on each one, and McCoy is really good at putting them in the context of what was going on in music history when they were written.  One downside is that you don't get to have that one week at the end of the course where you learn about more modern composers or the beatles or whatever contemporary music another professor might cover.  Overall I think it was a great way to learn about western music.\n\nMore than anything, McCoy just cares.  She cares about the music and about the class and about her students, and her enthusiasm is contagious.  She wants you to succeed and will go out of her way to help you understand concepts or to help you catch up if you miss a lecture.  Being there for students is an often overlooked asset in a teacher, and she just totally gets it.\n\n\n          Workload:\n        Assignments are a bit of a mess and a bit confusing, just because there's a ton of little things you have to turn in.  For each of the five units there is a half-page \"warm-up\" assignment, a 2-3 page paper, a short blog post, and a multiple choice quiz.  There are also two 3-page concert reports.  I would estimate about 4 hours of work a week, which is probably more than other music hum classes, but really not all that bad.  Late work is usually totally fine, just let her know what's up.","Date":"May 05, 2012"},{"_id":{ "$oid": "59ea3eb1e548b80e6a521cbe" },"Professor":"Marilyn McCoy","Course_ID":"HUMA W1123","Course_Name":"Masterpieces of Western Music (Music Humanities)","Review":"If you want Music Hum to be a light and enjoyable course, do not take it with Marilyn McCoy. There are lengthy and tedious assignments due every single class. Sometimes she assigns two homeworks to be due in one day, or due on days you don't have classes. Her exams are very easy, but the she takes the homework and the classes way too seriously. \n\nHer essay grading is tough. She is very disorganized when it comes to giving you feedback. She will make you rewrite anything below an 80% and then tell you your score is the same, even if you rewrote the entire thing. She is very enthusiastic about the course, which is nice, so you learn a lot. \n\nEvery other Music Hum teacher knows that we only take the class to finish the core, so it should be light and easy, but McCoy wants us to make Music Hum our number one priority, which is ridiculous. Find ANY other teacher for this class.\n\n\n          Workload:\n        5 2-page papers, 5 warm up assignments, 5 \"Journal\" assignments, 6 blog entires, 5 exams, a final discussion, and a Final exam.","Date":"April 08, 2012"}]